
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <script async src="https://www.googletagmanager.com/gtag/js?id=UA-136221103-1"></script>
        <script>
            window.dataLayer = window.dataLayer || [];
            function gtag(){dataLayer.push(arguments);}
            gtag('js', new Date());
            gtag('config', 'UA-136221103-1');
        </script>

        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>サイボウズ脆弱性報奨金制度で認定されたSSRF · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">

        <meta name="twitter:card" content="summary" />
        <meta name="twitter:title" content="サイボウズ脆弱性報奨金制度で認定されたSSRF" />
        <meta name="twitter:image" content="https://akaki.io/gitbook/images/apple-touch-icon-precomposed-152.png" />

        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
        <link rel="stylesheet" href="../book.css">
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="401i_in_monabako.html" />
    
    
    <link rel="prev" href="smtp_domain_takeover.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    Akaki I/O
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">2019</li>
        
        
    
        <li class="chapter " data-level="2.1" data-path="../2019/hackedu.html">
            
                <a href="../2019/hackedu.html">
            
                    
                    HackerOneに報告された脆弱性をHackEDUで再現する
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.2" data-path="../2019/text_injection.html">
            
                <a href="../2019/text_injection.html">
            
                    
                    脆弱性報奨金制度で認定されづらいテキストインジェクション
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">2018</li>
        
        
    
        <li class="chapter " data-level="3.1" data-path="practical_open_redirect_via_path.html">
            
                <a href="practical_open_redirect_via_path.html">
            
                    
                    Request-URIのパスからのオープンリダイレクト 実践編
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.2" data-path="open_redirect_via_path.html">
            
                <a href="open_redirect_via_path.html">
            
                    
                    Request-URIのパスからのオープンリダイレクト
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.3" data-path="smtp_domain_takeover.html">
            
                <a href="smtp_domain_takeover.html">
            
                    
                    SSRFを利用したメール送信ドメインの乗っ取り
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="3.4" data-path="ssrf_in_cybozu.html">
            
                <a href="ssrf_in_cybozu.html">
            
                    
                    サイボウズ脆弱性報奨金制度で認定されたSSRF
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.5" data-path="401i_in_monabako.html">
            
                <a href="401i_in_monabako.html">
            
                    
                    モナバコ脆弱性報奨金制度で認定された401インジェクション
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.6" data-path="learning_pentest_in_kobe.html">
            
                <a href="learning_pentest_in_kobe.html">
            
                    
                    大和SEC×神戸脆弱性診断の会でペネトレーションテストを学ぶ
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.7" data-path="impact_of_cookie_bomb.html">
            
                <a href="impact_of_cookie_bomb.html">
            
                    
                    CRLFインジェクションによるCookie Bombの脅威
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.8" data-path="analyzing_samy_xss_worm.html">
            
                <a href="analyzing_samy_xss_worm.html">
            
                    
                    XSSワーム「Samy」の動作を解析する
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.9" data-path="crlfi_via_path_of_request-uri.html">
            
                <a href="crlfi_via_path_of_request-uri.html">
            
                    
                    Request-URIのパスからのCRLFインジェクション
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="/#privacy-policy">
            Privacy Policy
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >サイボウズ脆弱性報奨金制度で認定されたSSRF</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x30B5;&#x30A4;&#x30DC;&#x30A6;&#x30BA;&#x8106;&#x5F31;&#x6027;&#x5831;&#x5968;&#x91D1;&#x5236;&#x5EA6;&#x3067;&#x8A8D;&#x5B9A;&#x3055;&#x308C;&#x305F;ssrf">&#x30B5;&#x30A4;&#x30DC;&#x30A6;&#x30BA;&#x8106;&#x5F31;&#x6027;&#x5831;&#x5968;&#x91D1;&#x5236;&#x5EA6;&#x3067;&#x8A8D;&#x5B9A;&#x3055;&#x308C;&#x305F;SSRF</h1>
<p>2017&#x5E74;11&#x6708;&#x306B;&#x958B;&#x50AC;&#x3055;&#x308C;&#x305F;&#x300C;<a href="https://cybozu.connpass.com/event/67056/" target="_blank">&#x30B5;&#x30A4;&#x30DC;&#x30A6;&#x30BA; &#x30D0;&#x30B0;&#x30CF;&#x30F3;&#x30BF;&#x30FC;&#x5408;&#x5BBF;</a>&#x300D;&#x3078;&#x306E;&#x53C2;&#x52A0;&#x3092;&#x6A5F;&#x306B;&#x3001;&#x30B5;&#x30A4;&#x30DC;&#x30A6;&#x30BA;&#x306E;<a href="https://cybozu.co.jp/products/bug-bounty/" target="_blank">&#x8106;&#x5F31;&#x6027;&#x5831;&#x5968;&#x91D1;&#x5236;&#x5EA6;</a>&#x306B;&#x6311;&#x6226;&#x3057;&#x305F;&#x3002;2017&#x5E74;&#x5EA6;&#x306B;&#x8A8D;&#x5B9A;&#x3055;&#x308C;&#x305F;cybozu.com&#x5171;&#x901A;&#x7BA1;&#x7406;&#x3067;&#x306E;SSRF&#x306E;&#x8A73;&#x7D30;&#x3092;&#x30B5;&#x30A4;&#x30DC;&#x30A6;&#x30BA;&#x3068;&#x5408;&#x610F;&#x306E;&#x4E0A;&#x3067;&#x958B;&#x793A;&#x3059;&#x308B;&#x3002;</p>
<p>&#x30B5;&#x30A4;&#x30DC;&#x30A6;&#x30BA;&#x306E;&#x5831;&#x5968;&#x91D1;&#x5236;&#x5EA6;&#x3067;&#x306F;&#x30AF;&#x30E9;&#x30A6;&#x30C9;&#x30B5;&#x30FC;&#x30D3;&#x30B9;&#x306E;&#x672C;&#x756A;&#x74B0;&#x5883;&#x3067;&#x306E;&#x8106;&#x5F31;&#x6027;&#x8ABF;&#x67FB;&#x304C;&#x7981;&#x6B62;&#x3055;&#x308C;&#x3066;&#x304A;&#x308A;&#x3001;&#x8ABF;&#x67FB;&#x5E0C;&#x671B;&#x8005;&#x306B;&#x306F; <code>cybozu-dev.com</code> &#x4E0A;&#x3067;&#x52D5;&#x4F5C;&#x3059;&#x308B;&#x691C;&#x8A3C;&#x74B0;&#x5883;&#x304C;&#x63D0;&#x4F9B;&#x3055;&#x308C;&#x308B;&#x3002;&#x4EE5;&#x964D;&#x306E;&#x8ABF;&#x67FB;&#x306F;&#x5168;&#x3066;&#x691C;&#x8A3C;&#x74B0;&#x5883;&#x3067;&#x5B9F;&#x65BD;&#x3057;&#x3066;&#x3044;&#x308B;&#x3002;</p>
<h2 id="cybozucom&#x5171;&#x901A;&#x7BA1;&#x7406;&#x306E;&#x6982;&#x8981;">cybozu.com&#x5171;&#x901A;&#x7BA1;&#x7406;&#x306E;&#x6982;&#x8981;</h2>
<p>&#x30B5;&#x30A4;&#x30DC;&#x30A6;&#x30BA;&#x304C;&#x4F01;&#x696D;&#x5411;&#x3051;&#x306B;&#x63D0;&#x4F9B;&#x3059;&#x308B;Office&#x3084;Garoon&#x3001;kintone&#x306A;&#x3069;&#x306E;&#x30AF;&#x30E9;&#x30A6;&#x30C9;&#x30B5;&#x30FC;&#x30D3;&#x30B9;&#x306F;&#x3001;&#x5171;&#x901A;&#x306E;&#x30C9;&#x30E1;&#x30A4;&#x30F3; <code>cybozu.com</code> &#x4E0A;&#x3067;&#x52D5;&#x4F5C;&#x3059;&#x308B;&#x3002;&#x5404;&#x30B5;&#x30FC;&#x30D3;&#x30B9;&#x306E;&#x30A2;&#x30AB;&#x30A6;&#x30F3;&#x30C8;&#x3084;&#x30BB;&#x30AD;&#x30E5;&#x30EA;&#x30C6;&#x30A3;&#x8A2D;&#x5B9A;&#x306A;&#x3069;&#x306F;&#x30B5;&#x30FC;&#x30D3;&#x30B9;&#x3054;&#x3068;&#x306B;&#x7BA1;&#x7406;&#x305B;&#x305A;&#x3001;&#x300C;cybozu.com&#x5171;&#x901A;&#x7BA1;&#x7406;&#x300D;&#x3067;&#x4E00;&#x5143;&#x7BA1;&#x7406;&#x3059;&#x308B;&#x4ED5;&#x69D8;&#x3068;&#x306A;&#x3063;&#x3066;&#x3044;&#x308B;&#x3002;&#x5229;&#x7528;&#x4F01;&#x696D;&#x306E;&#x7BA1;&#x7406;&#x8005;&#x306F;cybozu.com&#x5171;&#x901A;&#x7BA1;&#x7406;&#x304B;&#x3089;&#x793E;&#x54E1;&#x306E;&#x30A2;&#x30AB;&#x30A6;&#x30F3;&#x30C8;&#x3092;&#x767A;&#x884C;&#x3057;&#x3001;&#x6A29;&#x9650;&#x306A;&#x3069;&#x3092;&#x8A2D;&#x5B9A;&#x3067;&#x304D;&#x308B;&#x3002;</p>
<p>cybozu.com&#x5171;&#x901A;&#x7BA1;&#x7406;&#x3067;&#x306F;&#x3001;&#x5404;&#x30B5;&#x30FC;&#x30D3;&#x30B9;&#x304B;&#x3089;&#x9001;&#x4FE1;&#x3055;&#x308C;&#x308B;&#x30B7;&#x30B9;&#x30C6;&#x30E0;&#x30E1;&#x30FC;&#x30EB;&#x3082;&#x7BA1;&#x7406;&#x3067;&#x304D;&#x308B;&#x3002;&#x6A19;&#x6E96;&#x8A2D;&#x5B9A;&#x306E;&#x30B7;&#x30B9;&#x30C6;&#x30E0;&#x30E1;&#x30FC;&#x30EB;&#x306F; <code>no-reply@cybozu.com</code> &#x304B;&#x3089;&#x9001;&#x4FE1;&#x3055;&#x308C;&#x308B;&#x3002;&#x81EA;&#x793E;&#x306E;&#x30E1;&#x30FC;&#x30EB;&#x30A2;&#x30C9;&#x30EC;&#x30B9;&#x304B;&#x3089;&#x30B7;&#x30B9;&#x30C6;&#x30E0;&#x30E1;&#x30FC;&#x30EB;&#x3092;&#x9001;&#x4FE1;&#x3057;&#x305F;&#x3044;&#x5834;&#x5408;&#x306F;&#x3001;&#x4EE5;&#x4E0B;&#x306E;&#x30DA;&#x30FC;&#x30B8;&#x304B;&#x3089;SMTP&#x30B5;&#x30FC;&#x30D0;&#x30FC;&#x3092;&#x8A2D;&#x5B9A;&#x3059;&#x308B;&#x3002;</p>
<p><img src="https://user-images.githubusercontent.com/5434303/45262269-cc218e00-b44e-11e8-8c3f-c864222d7e43.png" alt="setting_smtp"></p>
<p>SMTP&#x30B5;&#x30FC;&#x30D0;&#x30FC;&#x306E;&#x8A2D;&#x5B9A;&#x3092;&#x4FDD;&#x5B58;&#x3059;&#x308B;&#x969B;&#x3001;&#x4EFB;&#x610F;&#x306E;&#x30E1;&#x30FC;&#x30EB;&#x30A2;&#x30C9;&#x30EC;&#x30B9;&#x5B9B;&#x306B;&#x30C6;&#x30B9;&#x30C8;&#x30E1;&#x30FC;&#x30EB;&#x3092;&#x9001;&#x4FE1;&#x3067;&#x304D;&#x308B;&#x3002;&#x4E0D;&#x9069;&#x5207;&#x306A;&#x8A2D;&#x5B9A;&#x306B;&#x3088;&#x308A;&#x30C6;&#x30B9;&#x30C8;&#x30E1;&#x30FC;&#x30EB;&#x306E;&#x9001;&#x4FE1;&#x304C;&#x5931;&#x6557;&#x3059;&#x308B;&#x3068;&#x3001;&#x4EE5;&#x4E0B;&#x306E;&#x30DA;&#x30FC;&#x30B8;&#x306B;&#x30A8;&#x30E9;&#x30FC;&#x304C;&#x6B8B;&#x308B;&#x3002;&#x8106;&#x5F31;&#x6027;&#x306F;SMTP&#x30B5;&#x30FC;&#x30D0;&#x30FC;&#x306E;&#x8A2D;&#x5B9A;&#x51E6;&#x7406;&#x306B;&#x5B58;&#x5728;&#x3057;&#x3066;&#x304A;&#x308A;&#x3001;&#x30C6;&#x30B9;&#x30C8;&#x30E1;&#x30FC;&#x30EB;&#x306E;&#x30A8;&#x30E9;&#x30FC;&#x3092;&#x624B;&#x304C;&#x304B;&#x308A;&#x306B;&#x767A;&#x898B;&#x3057;&#x305F;&#x3002;</p>
<p><img src="https://user-images.githubusercontent.com/5434303/44625513-76c18900-a946-11e8-85c3-f4efb3123e3e.png" alt="error_smtp"></p>
<h2 id="ssrf&#x306E;&#x8106;&#x5F31;&#x6027;">SSRF&#x306E;&#x8106;&#x5F31;&#x6027;</h2>
<p>&#x5165;&#x529B;&#x5024;&#x3068;&#x3057;&#x3066;&#x53D7;&#x3051;&#x53D6;&#x3063;&#x305F;IP&#x30A2;&#x30C9;&#x30EC;&#x30B9;&#x3084;URL&#x3078;&#x30B5;&#x30FC;&#x30D0;&#x30FC;&#x5074;&#x306E;&#x30A2;&#x30D7;&#x30EA;&#x30B1;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x304C;&#x30EA;&#x30AF;&#x30A8;&#x30B9;&#x30C8;&#x3059;&#x308B;&#x51E6;&#x7406;&#x304C;&#x3042;&#x308B;&#x3002;&#x305D;&#x306E;&#x969B;&#x306E;&#x5165;&#x529B;&#x5024;&#x691C;&#x8A3C;&#x306B;&#x4E0D;&#x5099;&#x304C;&#x3042;&#x308A;&#x3001;&#x5185;&#x90E8;&#x30CD;&#x30C3;&#x30C8;&#x30EF;&#x30FC;&#x30AF;&#x306E;&#x30DB;&#x30B9;&#x30C8;&#x3078;&#x306E;&#x30EA;&#x30AF;&#x30A8;&#x30B9;&#x30C8;&#x3092;&#x507D;&#x88C5;&#x3055;&#x308C;&#x308B;&#x554F;&#x984C;&#x304C;&#x30B5;&#x30FC;&#x30D0;&#x30FC;&#x30B5;&#x30A4;&#x30C9;&#x30EA;&#x30AF;&#x30A8;&#x30B9;&#x30C8;&#x30D5;&#x30A9;&#x30FC;&#x30B8;&#x30A7;&#x30EA;&#xFF08;SSRF&#xFF09;&#x3067;&#x3042;&#x308B;<sup id="f1"><a href="#fn1">1</a></sup>&#x3002;&#x30A4;&#x30F3;&#x30BF;&#x30FC;&#x30CD;&#x30C3;&#x30C8;&#x304B;&#x3089;&#x30A2;&#x30AF;&#x30BB;&#x30B9;&#x3067;&#x304D;&#x306A;&#x3044;&#x5185;&#x90E8;&#x30DB;&#x30B9;&#x30C8;&#x306E;&#x30DD;&#x30FC;&#x30C8;&#x958B;&#x9589;&#x3092;&#x8ABF;&#x67FB;&#x3055;&#x308C;&#x308B;&#x30AF;&#x30ED;&#x30B9;&#x30B5;&#x30A4;&#x30C8;&#x30DD;&#x30FC;&#x30C8;&#x30A2;&#x30BF;&#x30C3;&#x30AF;&#xFF08;XSPA&#xFF09;&#x306A;&#x3069;&#x306B;&#x60AA;&#x7528;&#x3055;&#x308C;&#x308B;&#x8106;&#x5F31;&#x6027;&#x3067;&#x3042;&#x308B;&#x3002;</p>
<p>&#x30B7;&#x30B9;&#x30C6;&#x30E0;&#x30E1;&#x30FC;&#x30EB;&#x306E;&#x8A2D;&#x5B9A;&#x3067;&#x306F;&#x3001;&#x30C6;&#x30B9;&#x30C8;&#x30E1;&#x30FC;&#x30EB;&#x3092;&#x9001;&#x4FE1;&#x3059;&#x308B;&#x969B;&#x306B;SMTP&#x30B5;&#x30FC;&#x30D0;&#x30FC;&#x3078;&#x63A5;&#x7D9A;&#x3092;&#x8A66;&#x307F;&#x308B;&#x3002;&#x30B5;&#x30FC;&#x30D0;&#x30FC;&#x540D;&#x306E;&#x5165;&#x529B;&#x5024;&#x691C;&#x8A3C;&#x306B;&#x4E0D;&#x5099;&#x304C;&#x5B58;&#x5728;&#x3057;&#x305F;&#x305F;&#x3081;SSRF&#x304C;&#x53EF;&#x80FD;&#x3068;&#x306A;&#x3063;&#x305F;&#x3002;&#x767A;&#x898B;&#x306B;&#x81F3;&#x308B;&#x307E;&#x3067;&#x306E;&#x8ABF;&#x67FB;&#x3092;&#x89E3;&#x8AAC;&#x3057;&#x3066;&#x3044;&#x304F;&#x3002;</p>
<h3 id="&#x30EB;&#x30FC;&#x30D7;&#x30D0;&#x30C3;&#x30AF;&#x3078;&#x306E;&#x63A5;&#x7D9A;">&#x30EB;&#x30FC;&#x30D7;&#x30D0;&#x30C3;&#x30AF;&#x3078;&#x306E;&#x63A5;&#x7D9A;</h3>
<p>&#x5185;&#x90E8;&#x30DB;&#x30B9;&#x30C8;&#x3078;&#x30EA;&#x30AF;&#x30A8;&#x30B9;&#x30C8;&#x3092;&#x507D;&#x88C5;&#x3059;&#x308B;&#x305F;&#x3081;&#x3001;&#x30B5;&#x30FC;&#x30D0;&#x30FC;&#x540D;&#x306B;&#x30EB;&#x30FC;&#x30D7;&#x30D0;&#x30C3;&#x30AF;&#x3092;&#x8A2D;&#x5B9A;&#x3057;&#x3066;&#x30B5;&#x30FC;&#x30D0;&#x30FC;&#x81EA;&#x8EAB;&#x3078;&#x306E;&#x63A5;&#x7D9A;&#x3092;&#x8A66;&#x307F;&#x308B;&#x3002;&#x30B5;&#x30FC;&#x30D0;&#x30FC;&#x540D;&#x306B; <code>localhost</code> &#x3092;&#x5165;&#x529B;&#x3059;&#x308B;&#x3068;&#x4EE5;&#x4E0B;&#x306E;&#x30A8;&#x30E9;&#x30FC;&#x306B;&#x3088;&#x308A;&#x8A2D;&#x5B9A;&#x3092;&#x4FDD;&#x5B58;&#x3067;&#x304D;&#x306A;&#x3044;&#x3002;</p>
<p><img src="https://user-images.githubusercontent.com/5434303/44303711-f5388c80-a382-11e8-9889-07c68c822eb8.png" alt="localhost:25"></p>
<p>&#x30EB;&#x30FC;&#x30D7;&#x30D0;&#x30C3;&#x30AF;&#x30A2;&#x30C9;&#x30EC;&#x30B9;&#x3067;&#x3042;&#x308B; <code>127.0.0.1</code> &#x306B;&#x5909;&#x66F4;&#x3057;&#x3066;&#x3082;&#x30A8;&#x30E9;&#x30FC;&#x306F;&#x767A;&#x751F;&#x3059;&#x308B;&#x3002;</p>
<p><img src="https://user-images.githubusercontent.com/5434303/44303714-100b0100-a383-11e8-8ba3-6703b76199af.png" alt="127.0.0.1:25"></p>
<p>&#x3053;&#x308C;&#x3089;&#x306E;&#x30A8;&#x30E9;&#x30FC;&#x306F;HTML5&#x3084;JavaScript&#x306B;&#x3088;&#x308B;&#x30D6;&#x30E9;&#x30A6;&#x30B6;&#x5074;&#x3067;&#x306E;&#x5165;&#x529B;&#x5024;&#x691C;&#x8A3C;&#x3067;&#x306F;&#x306A;&#x3044;&#x3002;&#x30B5;&#x30FC;&#x30D0;&#x30FC;&#x5074;&#x3067;&#x30EB;&#x30FC;&#x30D7;&#x30D0;&#x30C3;&#x30AF;&#x306E;&#x8A2D;&#x5B9A;&#x3092;&#x7981;&#x6B62;&#x3059;&#x308B;&#x5165;&#x529B;&#x5024;&#x691C;&#x8A3C;&#x304C;&#x5B9F;&#x88C5;&#x3055;&#x308C;&#x3066;&#x3044;&#x308B;&#x3002;</p>
<h3 id="ip&#x30A2;&#x30C9;&#x30EC;&#x30B9;&#x306E;&#x691C;&#x8A3C;&#x4E0D;&#x5099;">IP&#x30A2;&#x30C9;&#x30EC;&#x30B9;&#x306E;&#x691C;&#x8A3C;&#x4E0D;&#x5099;</h3>
<p>&#x7279;&#x6B8A;&#x7528;&#x9014;&#x306E;IP&#x30A2;&#x30C9;&#x30EC;&#x30B9;&#x3092;&#x307E;&#x3068;&#x3081;&#x305F;<a href="https://tools.ietf.org/html/rfc6890" target="_blank">RFC6890</a>&#x3067;&#x306F;&#x30EB;&#x30FC;&#x30D7;&#x30D0;&#x30C3;&#x30AF;&#x30A2;&#x30C9;&#x30EC;&#x30B9;&#x3092; <code>127.0.0.0/8</code> &#x3068;&#x5B9A;&#x7FA9;&#x3057;&#x3066;&#x3044;&#x308B;&#x3002;&#x305D;&#x306E;&#x305F;&#x3081; <code>127.0.0.1</code> &#x3060;&#x3051;&#x3067;&#x306A;&#x304F; <code>127.0.0.2</code> &#x304B;&#x3089; <code>127.255.255.254</code> &#x307E;&#x3067;&#x306E;IP&#x30A2;&#x30C9;&#x30EC;&#x30B9;&#x306F;&#x30EB;&#x30FC;&#x30D7;&#x30D0;&#x30C3;&#x30AF;&#x3068;&#x3057;&#x3066;&#x52D5;&#x4F5C;&#x3059;&#x308B;&#x3002;&#x30B5;&#x30FC;&#x30D0;&#x30FC;&#x540D;&#x306B; <code>127.0.0.2</code> &#x3092;&#x5165;&#x529B;&#x3059;&#x308B;&#x3068;&#x30A8;&#x30E9;&#x30FC;&#x306F;&#x767A;&#x751F;&#x305B;&#x305A;&#x3001;SMTP&#x30B5;&#x30FC;&#x30D0;&#x30FC;&#x306E;&#x8A2D;&#x5B9A;&#x3092;&#x4FDD;&#x5B58;&#x3067;&#x304D;&#x308B;&#x3002;&#x3057;&#x304B;&#x3057;&#x30C6;&#x30B9;&#x30C8;&#x30E1;&#x30FC;&#x30EB;&#x306E;&#x9001;&#x4FE1;&#x306B;&#x306F;&#x5931;&#x6557;&#x3057;&#x3001;&#x4EE5;&#x4E0B;&#x306E;&#x30A8;&#x30E9;&#x30FC;&#x304C;&#x5C65;&#x6B74;&#x306B;&#x6B8B;&#x308B;&#x3002;</p>
<p><img src="https://user-images.githubusercontent.com/5434303/44625499-50035280-a946-11e8-8999-8a4138b7c139.png" alt="127.0.0.2:25"></p>
<p>&#x300C;Connection refused&#x300D;&#x3068;&#x306E;&#x30A8;&#x30E9;&#x30FC;&#x304B;&#x3089;&#x3001;<code>127.0.0.2:25</code> &#x3068;&#x306E;&#x63A5;&#x7D9A;&#x306F;&#x78BA;&#x7ACB;&#x3067;&#x304D;&#x3066;&#x3044;&#x306A;&#x3044;&#x304C;&#x3001;&#x63A5;&#x7D9A;&#x30EA;&#x30AF;&#x30A8;&#x30B9;&#x30C8;&#x306F;&#x9001;&#x4FE1;&#x3067;&#x304D;&#x3066;&#x3044;&#x308B;&#x3053;&#x3068;&#x304C;&#x8AAD;&#x307F;&#x53D6;&#x308C;&#x308B;&#x3002;&#x30DD;&#x30FC;&#x30C8;&#x756A;&#x53F7;&#x3092;&#x5909;&#x66F4;&#x3057;&#x3066; <code>127.0.0.2:22</code> &#x3078;&#x306E;&#x63A5;&#x7D9A;&#x3092;&#x8A66;&#x307F;&#x308B;&#x3068;&#x30A8;&#x30E9;&#x30FC;&#x306E;&#x5185;&#x5BB9;&#x304C;&#x5909;&#x5316;&#x3059;&#x308B;&#x3002;</p>
<p><img src="https://user-images.githubusercontent.com/5434303/44625498-50035280-a946-11e8-91d3-b0db5724001f.png" alt="127.0.0.2:22"></p>
<p>22&#x756A;&#x30DD;&#x30FC;&#x30C8;&#x306F;SSH&#x306E;&#x6A19;&#x6E96;&#x30DD;&#x30FC;&#x30C8;&#x3067;&#x3042;&#x308B;&#x305F;&#x3081;&#x958B;&#x3044;&#x3066;&#x3044;&#x308B;&#x78BA;&#x7387;&#x304C;&#x9AD8;&#x3044;&#x3002;SSH&#x304C;&#x52D5;&#x4F5C;&#x3059;&#x308B;&#x30DD;&#x30FC;&#x30C8;&#x3078;SMTP&#x306E;&#x63A5;&#x7D9A;&#x30EA;&#x30AF;&#x30A8;&#x30B9;&#x30C8;&#x304C;&#x9001;&#x4FE1;&#x3055;&#x308C;&#x305F;&#x305F;&#x3081;&#x3001;&#x9069;&#x5207;&#x306A;&#x30EC;&#x30B9;&#x30DD;&#x30F3;&#x30B9;&#x3092;&#x53D7;&#x4FE1;&#x3067;&#x304D;&#x305A;&#x300C;Read timed out&#x300D;&#x306B;&#x306A;&#x3063;&#x305F;&#x3068;&#x63A8;&#x6E2C;&#x3055;&#x308C;&#x308B;&#x3002;HTTP&#x304C;&#x52D5;&#x4F5C;&#x3059;&#x308B;&#x78BA;&#x7387;&#x304C;&#x9AD8;&#x3044;8080&#x756A;&#x30DD;&#x30FC;&#x30C8;&#x3078;&#x306E;&#x63A5;&#x7D9A;&#x3067;&#x3082;&#x540C;&#x69D8;&#x306E;&#x30A8;&#x30E9;&#x30FC;&#x304C;&#x767A;&#x751F;&#x3059;&#x308B;&#x3002;</p>
<p><img src="https://user-images.githubusercontent.com/5434303/44625500-50035280-a946-11e8-8ffd-c10b782a42e8.png" alt="127.0.0.2:8080"></p>
<p>&#x3053;&#x308C;&#x3089;&#x306E;&#x6319;&#x52D5;&#x304B;&#x3089;&#x300C;Connection refused&#x300D;&#x3068;&#x306A;&#x308B;&#x30DD;&#x30FC;&#x30C8;&#x306F;&#x9589;&#x3058;&#x3066;&#x304A;&#x308A;&#x3001;&#x300C;Read timed out&#x300D;&#x3068;&#x306A;&#x308B;&#x30DD;&#x30FC;&#x30C8;&#x306F;&#x958B;&#x3044;&#x3066;&#x3044;&#x308B;&#x3068;&#x7279;&#x5B9A;&#x3067;&#x304D;&#x308B;&#x3002;&#x672C;&#x6765;&#x306F;&#x30A2;&#x30AF;&#x30BB;&#x30B9;&#x3067;&#x304D;&#x306A;&#x3044;&#x306F;&#x305A;&#x306E;&#x5185;&#x90E8;&#x30DB;&#x30B9;&#x30C8;&#xFF08;&#x30B5;&#x30FC;&#x30D0;&#x30FC;&#x81EA;&#x8EAB;&#xFF09;&#x3078;&#x30EA;&#x30AF;&#x30A8;&#x30B9;&#x30C8;&#x3092;&#x507D;&#x88C5;&#x3057;&#x3001;&#x30DD;&#x30FC;&#x30C8;&#x958B;&#x9589;&#x3092;&#x8ABF;&#x67FB;&#x3067;&#x304D;&#x308B;&#x72B6;&#x614B;&#x3060;&#x3063;&#x305F;&#x3002;&#x3053;&#x306E;&#x6319;&#x52D5;&#x306F;&#x300C;&#x30E1;&#x30FC;&#x30EB;&#x30B5;&#x30FC;&#x30D0;&#x8A2D;&#x5B9A;&#x306B;&#x95A2;&#x3059;&#x308B;&#x4E0D;&#x9069;&#x5207;&#x306A;&#x5165;&#x529B;&#x306E;&#x8106;&#x5F31;&#x6027;&#xFF08;<a href="https://kb.cybozu.support/article/33103/" target="_blank">CyVDB-1687</a>&#xFF09;&#x300D;&#x3068;&#x3057;&#x3066;&#x8A8D;&#x5B9A;&#x3055;&#x308C;&#x305F;&#x3002;</p>
<h2 id="&#x540C;&#x4E00;&#x8981;&#x56E0;&#x306E;&#x8106;&#x5F31;&#x6027;">&#x540C;&#x4E00;&#x8981;&#x56E0;&#x306E;&#x8106;&#x5F31;&#x6027;</h2>
<p>IPv4&#x30A2;&#x30C9;&#x30EC;&#x30B9;&#x306F;10&#x9032;&#x6570;&#x3067;&#x306E;&#x8868;&#x8A18;&#x304C;&#x4E00;&#x822C;&#x7684;&#x3060;&#x304C;&#x3001;8&#x9032;&#x6570;&#x3084;16&#x9032;&#x6570;&#x3067;&#x3082;&#x8868;&#x8A18;&#x3067;&#x304D;&#x308B;&#x3002;&#x307E;&#x305F; <code>0</code> &#x306E;&#x30AA;&#x30AF;&#x30C6;&#x30C3;&#x30C8;&#x306F;&#x7701;&#x7565;&#x3057;&#x3066;&#x3082;&#x52D5;&#x4F5C;&#x306B;&#x5F71;&#x97FF;&#x306F;&#x306A;&#x3044;&#x3002;&#x305D;&#x306E;&#x305F;&#x3081; <code>0177.0.0.1</code> &#x3084; <code>0177.00001</code> &#x306E;&#x3088;&#x3046;&#x306A;&#x4E00;&#x822C;&#x7684;&#x3067;&#x306A;&#x3044;&#x5F62;&#x5F0F;&#x306E;IP&#x30A2;&#x30C9;&#x30EC;&#x30B9;&#x3082;&#x3001;<code>127.0.0.1</code> &#x3068;&#x540C;&#x3058;&#x304F;&#x30EB;&#x30FC;&#x30D7;&#x30D0;&#x30C3;&#x30AF;&#x30A2;&#x30C9;&#x30EC;&#x30B9;&#x3068;&#x3057;&#x3066;&#x89E3;&#x91C8;&#x3055;&#x308C;&#x308B;<sup id="f2"><a href="#fn2">2</a></sup>&#x3002;&#x30B7;&#x30B9;&#x30C6;&#x30E0;&#x30E1;&#x30FC;&#x30EB;&#x306E;&#x8A2D;&#x5B9A;&#x3067;&#x306F;SMTP&#x30B5;&#x30FC;&#x30D0;&#x30FC;&#x3068;&#x3057;&#x3066; <code>127.0.0.1</code> &#x306E;&#x8A2D;&#x5B9A;&#x3092;&#x7981;&#x6B62;&#x3057;&#x3066;&#x3044;&#x308B;&#x304C;&#x3001;&#x4E00;&#x822C;&#x7684;&#x3067;&#x306A;&#x3044;&#x5F62;&#x5F0F;&#x306B;&#x5909;&#x63DB;&#x3059;&#x308B;&#x3053;&#x3068;&#x3067;&#x8A2D;&#x5B9A;&#x3067;&#x304D;&#x308B;&#x72B6;&#x614B;&#x3060;&#x3063;&#x305F;&#x3002;</p>
<p><img src="https://user-images.githubusercontent.com/5434303/44625501-50035280-a946-11e8-81ef-1bc615acf01a.png" alt="0177.0.0.1:25"></p>
<p><img src="https://user-images.githubusercontent.com/5434303/44625502-509be900-a946-11e8-926e-b42ee7925b2d.png" alt="0177.00001:25"></p>
<p>&#x3053;&#x306E;&#x6319;&#x52D5;&#x306F;IP&#x30A2;&#x30C9;&#x30EC;&#x30B9;&#x306E;&#x300C;&#x5F62;&#x5F0F;&#x300D;&#x306E;&#x691C;&#x8A3C;&#x4E0D;&#x5099;&#x3067;&#x3042;&#x308A;&#x3001;CyVDB-1687&#x306E;&#x539F;&#x56E0;&#x3068;&#x306A;&#x3063;&#x305F;IP&#x30A2;&#x30C9;&#x30EC;&#x30B9;&#x306E;&#x300C;&#x7528;&#x9014;&#x300D;&#x306E;&#x691C;&#x8A3C;&#x4E0D;&#x5099;&#x3068;&#x306F;&#x7570;&#x306A;&#x308B;&#x554F;&#x984C;&#x3060;&#x3068;&#x8003;&#x3048;&#x308B;&#x3002;&#x306A;&#x305C;&#x306A;&#x3089;&#x7528;&#x9014;&#x306E;&#x691C;&#x8A3C;&#x4E0D;&#x5099;&#x3092;&#x4FEE;&#x6B63;&#x3057; <code>127.0.0.2</code> &#x3092;&#x7981;&#x6B62;&#x3057;&#x305F;&#x3068;&#x3057;&#x3066;&#x3082;&#x3001;&#x5F62;&#x5F0F;&#x306E;&#x691C;&#x8A3C;&#x4E0D;&#x5099;&#x304C;&#x6B8B;&#x308C;&#x3070; <code>0177.0.0.2</code> &#x3092;&#x8A2D;&#x5B9A;&#x3067;&#x304D;&#x308B;&#x304B;&#x3089;&#x3067;&#x3042;&#x308B;&#x3002;&#x3053;&#x306E;&#x3088;&#x3046;&#x306A;&#x7406;&#x7531;&#x304B;&#x3089;&#x5F62;&#x5F0F;&#x306E;&#x691C;&#x8A3C;&#x4E0D;&#x5099;&#x3092;&#x5225;&#x306E;&#x8106;&#x5F31;&#x6027;&#x3068;&#x3057;&#x3066;&#x5831;&#x544A;&#x3057;&#x305F;&#x304C;&#x3001;&#x8A55;&#x4FA1;&#x306F;&#x540C;&#x4E00;&#x8981;&#x56E0;&#xFF08;&#x91CD;&#x8907;&#xFF09;&#x3067;&#x3042;&#x3063;&#x305F;&#x3002;&#x8A55;&#x4FA1;&#x7406;&#x7531;&#x306B;&#x3064;&#x3044;&#x3066;&#x30B5;&#x30A4;&#x30DC;&#x30A6;&#x30BA;&#x306F;&#x300C;&#x3069;&#x3061;&#x3089;&#x3082;&#x5165;&#x529B;&#x3055;&#x308C;&#x305F;IP&#x30A2;&#x30C9;&#x30EC;&#x30B9;&#x3092;&#x9069;&#x5207;&#x306B;&#x691C;&#x8A3C;&#x3057;&#x3066;&#x3044;&#x306A;&#x3044;&#x3053;&#x3068;&#x304C;&#x554F;&#x984C;&#x3067;&#x3042;&#x308B;&#x300D;&#x3068;&#x8FF0;&#x3079;&#x3066;&#x3044;&#x308B;&#x3002;</p>
<h2 id="&#x6240;&#x611F;">&#x6240;&#x611F;</h2>
<p>&#x540C;&#x4E00;&#x8981;&#x56E0;&#x3068;&#x306A;&#x3063;&#x305F;IP&#x30A2;&#x30C9;&#x30EC;&#x30B9;&#x306E;&#x300C;&#x5F62;&#x5F0F;&#x300D;&#x3068;&#x300C;&#x7528;&#x9014;&#x300D;&#x306E;&#x691C;&#x8A3C;&#x4E0D;&#x5099;&#x3092;&#x4E21;&#x65B9;&#x3068;&#x3082;&#x8A8D;&#x5B9A;&#x3057;&#x3066;&#x3082;&#x3089;&#x3046;&#x306B;&#x306F;&#x3001;&#x4E00;&#x65B9;&#x306E;&#x4E0D;&#x5099;&#x3092;&#x5148;&#x306B;&#x5831;&#x544A;&#x3057;&#x3001;&#x4FEE;&#x6B63;&#x3055;&#x308C;&#x305F;&#x691C;&#x8A3C;&#x3092;&#x3082;&#x3046;&#x4E00;&#x65B9;&#x306E;&#x4E0D;&#x5099;&#x306B;&#x3088;&#x308A;&#x56DE;&#x907F;&#x3067;&#x304D;&#x308B;&#x3053;&#x3068;&#x3092;&#x5B9F;&#x8A3C;&#x3059;&#x3079;&#x304D;&#x3060;&#x3063;&#x305F;&#x3002;&#x3057;&#x304B;&#x3057;2017&#x5E74;&#x5EA6;&#x306E;&#x5831;&#x5968;&#x91D1;&#x5236;&#x5EA6;&#x306E;&#x63D0;&#x51FA;&#x671F;&#x9650;&#x304C;&#x8FEB;&#x3063;&#x3066;&#x3044;&#x305F;&#x305F;&#x3081;&#x3001;&#x4E21;&#x65B9;&#x3092;&#x540C;&#x6642;&#x306B;&#x5831;&#x544A;&#x3057;&#x3066;&#x3057;&#x307E;&#x3063;&#x305F;&#x3002;&#x4E00;&#x65B9;&#x306E;&#x4FEE;&#x6B63;&#x3092;&#x5F85;&#x3063;&#x3066;&#x304B;&#x3089;&#x3082;&#x3046;&#x4E00;&#x65B9;&#x3092;&#x5831;&#x544A;&#x3057;&#x3066;&#x3044;&#x308C;&#x3070;&#x3001;&#x4E21;&#x65B9;&#x3068;&#x3082;&#x8A8D;&#x5B9A;&#x3057;&#x3066;&#x3082;&#x3089;&#x3048;&#x305F;&#x3060;&#x308D;&#x3046;&#x3002;&#x305F;&#x3060;&#x3057;&#x4FEE;&#x6B63;&#x3092;&#x5F85;&#x3063;&#x3066;&#x3044;&#x308B;&#x9593;&#x306B;&#x3082;&#x3046;&#x4E00;&#x65B9;&#x3092;&#x4ED6;&#x306E;&#x30D0;&#x30B0;&#x30CF;&#x30F3;&#x30BF;&#x30FC;&#x306B;&#x5831;&#x544A;&#x3055;&#x308C;&#x3066;&#x3057;&#x307E;&#x3046;&#x30EA;&#x30B9;&#x30AF;&#x306F;&#x3042;&#x308B;&#x3002;&#x6B21;&#x5E74;&#x5EA6;&#x306E;&#x5831;&#x5968;&#x91D1;&#x5236;&#x5EA6;&#x3067;&#x306F;&#x65B9;&#x91DD;&#x304C;&#x5909;&#x308F;&#x3063;&#x3066;&#x3057;&#x307E;&#x3046;&#x30EA;&#x30B9;&#x30AF;&#x3082;&#x8003;&#x3048;&#x3089;&#x308C;&#x308B;&#x3002;&#x540C;&#x4E00;&#x51E6;&#x7406;&#x3067;&#x767A;&#x898B;&#x3057;&#x305F;&#x985E;&#x4F3C;&#x306E;&#x8106;&#x5F31;&#x6027;&#x306F;&#x5831;&#x544A;&#x6642;&#x671F;&#x3092;&#x898B;&#x8A08;&#x3089;&#x3046;&#x5FC5;&#x8981;&#x304C;&#x3042;&#x308B;&#x3053;&#x3068;&#x3092;&#x77E5;&#x308A;&#x3001;&#x30D0;&#x30B0;&#x30D0;&#x30A6;&#x30F3;&#x30C6;&#x30A3;&#x306E;&#x5965;&#x6DF1;&#x3055;&#x3092;&#x5B9F;&#x611F;&#x3057;&#x305F;&#x3002;</p>
<p>&#x30A8;&#x30F3;&#x30C8;&#x30EA;&#x30FC;&#x306E;&#x516C;&#x958B;&#x306B;&#x3042;&#x305F;&#x308A;&#x30B5;&#x30A4;&#x30DC;&#x30A6;&#x30BA;&#x3078;CyVDB-1687&#x306E;&#x958B;&#x793A;&#x53EF;&#x5426;&#x3092;&#x78BA;&#x8A8D;&#x3057;&#x3001;<a href="https://github.com/cybozu/bugbounty/commit/f96dc4762db886ccb6a8a75018a9ef6e47ba4cbf" target="_blank">&#x8106;&#x5F31;&#x6027;&#x8A8D;&#x5B9A;&#x30AC;&#x30A4;&#x30C9;&#x30E9;&#x30A4;&#x30F3;&#x306E;&#x66F4;&#x65B0;</a>&#x5F8C;&#x3092;&#x6761;&#x4EF6;&#x306B;&#x958B;&#x793A;&#x304C;&#x8A31;&#x53EF;&#x3055;&#x308C;&#x305F;&#x3002;&#x3053;&#x306E;&#x66F4;&#x65B0;&#x306B;&#x3088;&#x308A;&#x30B5;&#x30A4;&#x30DC;&#x30A6;&#x30BA;&#x306F;XSPA&#x3092;&#x8106;&#x5F31;&#x6027;&#x3068;&#x3057;&#x3066;&#x8A8D;&#x5B9A;&#x3057;&#x306A;&#x3044;&#x65B9;&#x91DD;&#x306B;&#x5909;&#x308F;&#x3063;&#x305F;&#x3002;&#x4ECA;&#x56DE;&#x306E;&#x3088;&#x3046;&#x306A;&#x4EFB;&#x610F;&#x306E;&#x30B5;&#x30FC;&#x30D0;&#x30FC;&#x540D;&#x3068;&#x30DD;&#x30FC;&#x30C8;&#x756A;&#x53F7;&#x3092;&#x8A2D;&#x5B9A;&#x3067;&#x304D;&#x308B;&#x6A5F;&#x80FD;&#x3067;&#x306E;SSRF&#x306E;&#x5834;&#x5408;&#x3001;XSPA&#x306E;&#x5B9F;&#x8A3C;&#x3060;&#x3051;&#x3060;&#x3068;&#x4ECA;&#x5F8C;&#x306F;&#x8A8D;&#x5B9A;&#x3055;&#x308C;&#x306A;&#x3044;&#x3060;&#x308D;&#x3046;&#x3002;&#x3088;&#x308A;&#x73FE;&#x5B9F;&#x7684;&#x306A;&#x8105;&#x5A01;&#x3092;&#x793A;&#x3055;&#x306A;&#x3051;&#x308C;&#x3070;&#x306A;&#x3089;&#x306A;&#x3044;&#x3002;</p>
<p>&#x6642;&#x7CFB;&#x5217;&#xFF1A;<br>2017&#x5E74;12&#x6708;20&#x65E5; - SSRF&#x3092;&#x767A;&#x898B;<br>2017&#x5E74;12&#x6708;20&#x65E5; - SSRF&#x3092;&#x30B5;&#x30A4;&#x30DC;&#x30A6;&#x30BA;&#x3078;&#x5831;&#x544A;<br>2018&#x5E74;1&#x6708;31&#x65E5; - &#x30B5;&#x30A4;&#x30DC;&#x30A6;&#x30BA;&#x304B;&#x3089;CVSS 2.7&#x3067;&#x8A8D;&#x5B9A;&#x3068;&#x306E;&#x9023;&#x7D61;<br>2018&#x5E74;3&#x6708;30&#x65E5; - &#x30B5;&#x30A4;&#x30DC;&#x30A6;&#x30BA;&#x304C;&#x8106;&#x5F31;&#x6027;&#x60C5;&#x5831;&#x3092;&#x516C;&#x958B;<br>2018&#x5E74;5&#x6708;31&#x65E5; - &#x30B5;&#x30A4;&#x30DC;&#x30A6;&#x30BA;&#x304B;&#x3089;135,000&#x5186;&#x304C;&#x5165;&#x91D1;<br>2018&#x5E74;9&#x6708;4&#x65E5; - &#x30B5;&#x30A4;&#x30DC;&#x30A6;&#x30BA;&#x304C;&#x30AC;&#x30A4;&#x30C9;&#x30E9;&#x30A4;&#x30F3;&#x3092;&#x66F4;&#x65B0;  </p>
<hr>
<p><sup id="fn1"><a href="#f1">1</a></sup> HackerOne&#x306E;&#x5171;&#x540C;&#x5275;&#x696D;&#x8005;&#x3067;&#x3042;&#x308B;<a href="https://twitter.com/jobertabma/status/949770993781817344" target="_blank">Jobert Abma&#x6C0F;&#x306E;&#x8003;&#x3048;</a>&#x306B;&#x5F93;&#x3044;&#x3001;&#x5185;&#x90E8;&#x30CD;&#x30C3;&#x30C8;&#x30EF;&#x30FC;&#x30AF;&#x3078;&#x306E;&#x30EA;&#x30AF;&#x30A8;&#x30B9;&#x30C8;&#x507D;&#x88C5;&#x3092;SSRF&#x3068;&#x3059;&#x308B;&#x3002;<br><sup id="fn2"><a href="#f2">2</a></sup> &#x5BFA;&#x7530;&#x3055;&#x3093;&#x304C;<a href="http://d.hatena.ne.jp/teracc/20120510#1336662656" target="_blank">&#x30EB;&#x30FC;&#x30D7;&#x30D0;&#x30C3;&#x30AF;&#x3068;&#x3057;&#x3066;&#x89E3;&#x91C8;&#x3055;&#x308C;&#x308B;&#x5F62;&#x5F0F;</a>&#x3092;&#x307E;&#x3068;&#x3081;&#x3066;&#x3044;&#x308B;&#x3002;  </p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="smtp_domain_takeover.html" class="navigation navigation-prev " aria-label="Previous page: SSRFを利用したメール送信ドメインの乗っ取り">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="401i_in_monabako.html" class="navigation navigation-next " aria-label="Next page: モナバコ脆弱性報奨金制度で認定された401インジェクション">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"サイボウズ脆弱性報奨金制度で認定されたSSRF","level":"3.4","depth":1,"next":{"title":"モナバコ脆弱性報奨金制度で認定された401インジェクション","level":"3.5","depth":1,"path":"2018/401i_in_monabako.md","ref":"2018/401i_in_monabako.md","articles":[]},"previous":{"title":"SSRFを利用したメール送信ドメインの乗っ取り","level":"3.3","depth":1,"path":"2018/smtp_domain_takeover.md","ref":"2018/smtp_domain_takeover.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["-sharing"],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"book.css"}},"file":{"path":"2018/ssrf_in_cybozu.md","mtime":"2019-03-21T23:24:50.420Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2019-03-22T01:14:19.413Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

