
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <script async src="https://www.googletagmanager.com/gtag/js?id=UA-136221103-1"></script>
        <script>
            window.dataLayer = window.dataLayer || [];
            function gtag(){dataLayer.push(arguments);}
            gtag('js', new Date());
            gtag('config', 'UA-136221103-1');
        </script>

        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>脆弱性報奨金制度で認定されづらいテキストインジェクション · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">

        <meta name="twitter:card" content="summary" />
        <meta name="twitter:title" content="脆弱性報奨金制度で認定されづらいテキストインジェクション" />
        <meta name="twitter:image" content="https://avatars.githubusercontent.com/atsunoda" />

        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
        <link rel="stylesheet" href="../book.css">
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="../" />
    
    
    <link rel="prev" href="hackedu.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    Akaki I/O
            
                </a>
            

            
        </li>
    

    
        
        <li class="divider"></li>
        
        
    
        <li class="chapter " data-level="2.1" data-path="../">
            
                <a href="../#2019">
            
                    
                    2019
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="2.1.1" data-path="cloud-waf_bypass.html">
            
                <a href="cloud-waf_bypass.html">
            
                    
                    オリジンIPの特定によるクラウド型WAFのバイパス
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.1.2" data-path="learning_powershell.html">
            
                <a href="learning_powershell.html">
            
                    
                    大和セキュリティ勉強会でPowerShellの基礎を学ぶ
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.1.3" data-path="hackedu.html">
            
                <a href="hackedu.html">
            
                    
                    HackerOneに報告された脆弱性をHackEDUで再現する
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="2.1.4" data-path="text_injection.html">
            
                <a href="text_injection.html">
            
                    
                    脆弱性報奨金制度で認定されづらいテキストインジェクション
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="2.2" data-path="../">
            
                <a href="../#2018">
            
                    
                    2018
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="2.2.1" data-path="../2018/practical_open_redirect_via_path.html">
            
                <a href="../2018/practical_open_redirect_via_path.html">
            
                    
                    Request-URIのパスからのオープンリダイレクト 実践編
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.2.2" data-path="../2018/open_redirect_via_path.html">
            
                <a href="../2018/open_redirect_via_path.html">
            
                    
                    Request-URIのパスからのオープンリダイレクト
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.2.3" data-path="../2018/smtp_domain_takeover.html">
            
                <a href="../2018/smtp_domain_takeover.html">
            
                    
                    SSRFを利用したメール送信ドメインの乗っ取り
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.2.4" data-path="../2018/ssrf_in_cybozu.html">
            
                <a href="../2018/ssrf_in_cybozu.html">
            
                    
                    サイボウズ脆弱性報奨金制度で認定されたSSRF
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.2.5" data-path="../2018/401i_in_monabako.html">
            
                <a href="../2018/401i_in_monabako.html">
            
                    
                    モナバコ脆弱性報奨金制度で認定された401インジェクション
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.2.6" data-path="../2018/learning_pentest_in_kobe.html">
            
                <a href="../2018/learning_pentest_in_kobe.html">
            
                    
                    大和SEC×神戸脆弱性診断の会でペネトレーションテストを学ぶ
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.2.7" data-path="../2018/impact_of_cookie_bomb.html">
            
                <a href="../2018/impact_of_cookie_bomb.html">
            
                    
                    CRLFインジェクションによるCookie Bombの脅威
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.2.8" data-path="../2018/analyzing_samy_xss_worm.html">
            
                <a href="../2018/analyzing_samy_xss_worm.html">
            
                    
                    XSSワーム「Samy」の動作を解析する
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.2.9" data-path="../2018/crlfi_via_path_of_request-uri.html">
            
                <a href="../2018/crlfi_via_path_of_request-uri.html">
            
                    
                    Request-URIのパスからのCRLFインジェクション
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    
        
        <li class="divider"></li>
        
        
    
        <li class="chapter " data-level="3.1" data-path="../">
            
                <a href="../#privacy-policy">
            
                    
                    Privacy Policy
            
                </a>
            

            
        </li>
    

    

</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >脆弱性報奨金制度で認定されづらいテキストインジェクション</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x8106;&#x5F31;&#x6027;&#x5831;&#x5968;&#x91D1;&#x5236;&#x5EA6;&#x3067;&#x8A8D;&#x5B9A;&#x3055;&#x308C;&#x3065;&#x3089;&#x3044;&#x30C6;&#x30AD;&#x30B9;&#x30C8;&#x30A4;&#x30F3;&#x30B8;&#x30A7;&#x30AF;&#x30B7;&#x30E7;&#x30F3;">&#x8106;&#x5F31;&#x6027;&#x5831;&#x5968;&#x91D1;&#x5236;&#x5EA6;&#x3067;&#x8A8D;&#x5B9A;&#x3055;&#x308C;&#x3065;&#x3089;&#x3044;&#x30C6;&#x30AD;&#x30B9;&#x30C8;&#x30A4;&#x30F3;&#x30B8;&#x30A7;&#x30AF;&#x30B7;&#x30E7;&#x30F3;</h1>
<p>&#x3053;&#x308C;&#x307E;&#x3067;&#x306E;&#x30A8;&#x30F3;&#x30C8;&#x30EA;&#x30FC;&#x3067;&#x306F;&#x8106;&#x5F31;&#x6027;&#x5831;&#x5968;&#x91D1;&#x5236;&#x5EA6;&#x3067;&#x8A8D;&#x5B9A;&#x3055;&#x308C;&#x305F;&#x8106;&#x5F31;&#x6027;&#x3092;&#x53D6;&#x308A;&#x4E0A;&#x3052;&#x3066;&#x304D;&#x305F;&#x304C;&#x3001;&#x4ECA;&#x56DE;&#x306F;&#x9006;&#x306B;&#x8A8D;&#x5B9A;&#x3055;&#x308C;&#x306A;&#x304B;&#x3063;&#x305F;&#x8106;&#x5F31;&#x6027;&#x3092;&#x53D6;&#x308A;&#x4E0A;&#x3052;&#x308B;&#x3002;&#x79C1;&#x304C;&#x904E;&#x53BB;&#x306B;<a href="https://monabako.com/#/bugbounty" target="_blank">&#x30E2;&#x30CA;&#x30D0;&#x30B3;</a>&#x3068;<a href="https://cybozu.co.jp/products/bug-bounty/" target="_blank">&#x30B5;&#x30A4;&#x30DC;&#x30A6;&#x30BA;</a>&#x3078;&#x5831;&#x544A;&#x3057;&#x3001;&#x8A8D;&#x5B9A;&#x5BFE;&#x8C61;&#x5916;&#x3068;&#x306A;&#x3063;&#x305F;&#x30C6;&#x30AD;&#x30B9;&#x30C8;&#x30A4;&#x30F3;&#x30B8;&#x30A7;&#x30AF;&#x30B7;&#x30E7;&#x30F3;&#x306E;&#x8A73;&#x7D30;&#x3092;&#x632F;&#x308A;&#x8FD4;&#x308A;&#x306A;&#x304C;&#x3089;&#x3001;&#x305D;&#x306E;&#x8105;&#x5A01;&#x306B;&#x3064;&#x3044;&#x3066;&#x8003;&#x3048;&#x3066;&#x3044;&#x304F;&#x3002;&#x307E;&#x305F;&#x6700;&#x5F8C;&#x306B;&#x30C6;&#x30AD;&#x30B9;&#x30C8;&#x30A4;&#x30F3;&#x30B8;&#x30A7;&#x30AF;&#x30B7;&#x30E7;&#x30F3;&#x304C;&#x8105;&#x5A01;&#x306B;&#x306A;&#x308A;&#x5F97;&#x308B;&#x597D;&#x4E8B;&#x4F8B;&#x3082;&#x7D39;&#x4ECB;&#x3059;&#x308B;&#x3002;</p>
<h2 id="&#x30C6;&#x30AD;&#x30B9;&#x30C8;&#x30A4;&#x30F3;&#x30B8;&#x30A7;&#x30AF;&#x30B7;&#x30E7;&#x30F3;&#x3068;&#x306F;">&#x30C6;&#x30AD;&#x30B9;&#x30C8;&#x30A4;&#x30F3;&#x30B8;&#x30A7;&#x30AF;&#x30B7;&#x30E7;&#x30F3;&#x3068;&#x306F;</h2>
<p>&#x5165;&#x529B;&#x5024;&#x3068;&#x3057;&#x3066;&#x53D7;&#x3051;&#x53D6;&#x3063;&#x305F;&#x6587;&#x5B57;&#x5217;&#x3092;Web&#x30DA;&#x30FC;&#x30B8;&#x306A;&#x3069;&#x306B;&#x8868;&#x793A;&#x3059;&#x308B;&#x52D5;&#x4F5C;&#x306B;&#x304A;&#x3044;&#x3066;&#x3001;&#x672C;&#x6765;&#x306F;&#x6587;&#x7AE0;&#x306E;&#x66F8;&#x304D;&#x8FBC;&#x307F;&#x3092;&#x60F3;&#x5B9A;&#x3057;&#x3066;&#x3044;&#x306A;&#x3044;&#x90E8;&#x5206;&#x306B;&#x4EFB;&#x610F;&#x306E;&#x6587;&#x7AE0;&#x3092;&#x633F;&#x5165;&#x3055;&#x308C;&#x308B;&#x8106;&#x5F31;&#x6027;&#x304C;&#x30C6;&#x30AD;&#x30B9;&#x30C8;&#x30A4;&#x30F3;&#x30B8;&#x30A7;&#x30AF;&#x30B7;&#x30E7;&#x30F3;&#x3067;&#x3042;&#x308B;&#x3002;OWASP&#x3067;&#x306F;<a href="https://www.owasp.org/index.php/Content_Spoofing" target="_blank">&#x30B3;&#x30F3;&#x30C6;&#x30F3;&#x30C4;&#x30B9;&#x30D7;&#x30FC;&#x30D5;&#x30A3;&#x30F3;&#x30B0;</a>&#x306E;&#x4E00;&#x7A2E;&#x3068;&#x3055;&#x308C;&#x3066;&#x3044;&#x308B;&#x3002;</p>
<p>&#x653B;&#x6483;&#x8005;&#x306B;&#x3088;&#x3063;&#x3066;&#x66F8;&#x304D;&#x63DB;&#x3048;&#x3089;&#x308C;&#x305F;&#x6587;&#x7AE0;&#x3092;&#x8AAD;&#x3093;&#x3060;&#x88AB;&#x5BB3;&#x8005;&#x304C;&#x3001;&#x305D;&#x306E;&#x5185;&#x5BB9;&#x306B;&#x5F93;&#x3063;&#x305F;&#x5834;&#x5408;&#x306B;&#x5B9F;&#x5BB3;&#x304C;&#x751F;&#x3058;&#x308B;&#x3002;HackerOne&#x3067;&#x516C;&#x958B;&#x3055;&#x308C;&#x3066;&#x3044;&#x308B;&#x30C6;&#x30AD;&#x30B9;&#x30C8;&#x30A4;&#x30F3;&#x30B8;&#x30A7;&#x30AF;&#x30B7;&#x30E7;&#x30F3;&#x306E;&#x30EC;&#x30DD;&#x30FC;&#x30C8;&#x306E;&#x591A;&#x304F;&#x306F;Apache&#x306E;&#x6A19;&#x6E96;404&#x30DA;&#x30FC;&#x30B8;&#x306B;&#x8868;&#x793A;&#x3055;&#x308C;&#x308B;&#x6587;&#x7AE0;&#x3092;&#x66F8;&#x304D;&#x63DB;&#x3048;&#x3066;&#x3044;&#x308B;&#x3002;&#x4F8B;&#x3048;&#x3070;<a href="https://hackerone.com/reports/134388" target="_blank">#134388</a>&#x3067;&#x306F;&#x300C;&#x6307;&#x5B9A;&#x306E;URL&#x306F;&#x898B;&#x3064;&#x304B;&#x3089;&#x306A;&#x304B;&#x3063;&#x305F;&#x300D;&#x3068;&#x3044;&#x3046;&#x8DA3;&#x65E8;&#x306E;&#x30A8;&#x30E9;&#x30FC;&#x30E1;&#x30C3;&#x30BB;&#x30FC;&#x30B8;&#x3092;&#x3001;&#x4EE5;&#x4E0B;&#x306E;&#x3088;&#x3046;&#x306B;&#x300C;&#x6307;&#x5B9A;&#x306E;URL&#x306F; <code>evil.com</code> &#x3078;&#x5909;&#x66F4;&#x306B;&#x306A;&#x3063;&#x305F;&#x300D;&#x3068;&#x3044;&#x3046;&#x8DA3;&#x65E8;&#x306B;&#x66F8;&#x304D;&#x63DB;&#x3048;&#x3066;&#x3044;&#x308B;&#x3002;</p>
<p>hxxps://example.com/has%20been%20changed%20by%20a%20new%20one%20hxxps://evil.com%20so%20go%20to%20the%20new%20one%20since%20this%20one</p>
<p><img src="https://user-images.githubusercontent.com/5434303/50736289-003f6c80-11ff-11e9-9e13-de8a41c9d371.png" alt="not_found"></p>
<p><code>/</code> &#x4EE5;&#x964D;&#x306E;&#x9EC4;&#x8272;&#x3044;&#x90E8;&#x5206;&#x304C;&#x8FFD;&#x8A18;&#x3055;&#x308C;&#x305F;&#x6587;&#x7AE0;&#x3067;&#x3042;&#x308B;&#x3002;&#x672C;&#x6765;&#x306F;&#x5B58;&#x5728;&#x3057;&#x306A;&#x3044;&#x30D1;&#x30B9;&#x304C;&#x8868;&#x793A;&#x3055;&#x308C;&#x308B;&#x90E8;&#x5206;&#x306B;&#x3001;&#x6587;&#x7AE0;&#x3068;&#x3057;&#x3066;&#x6210;&#x308A;&#x7ACB;&#x3064;&#x3088;&#x3046;&#x306A;&#x6587;&#x5B57;&#x5217;&#x3092;&#x633F;&#x5165;&#x3057;&#x3066;&#x3044;&#x308B;&#x3002;&#x3053;&#x306E;&#x4F8B;&#x3067;&#x306F;&#x30D1;&#x30B9;&#x304B;&#x3089;&#x306E;&#x5165;&#x529B;&#x306B;&#x3088;&#x308A;&#x6587;&#x7AE0;&#x3092;&#x633F;&#x5165;&#x3057;&#x3066;&#x3044;&#x308B;&#x304C;&#x3001;&#x30D1;&#x30E9;&#x30E1;&#x30FC;&#x30BF;&#x306E;&#x5024;&#x304B;&#x3089;&#x633F;&#x5165;&#x3067;&#x304D;&#x308B;&#x30B1;&#x30FC;&#x30B9;&#x3082;&#x5F53;&#x7136;&#x3042;&#x308B;&#x3002;&#x79C1;&#x304C;&#x904E;&#x53BB;&#x306B;&#x5831;&#x544A;&#x3057;&#x305F;&#x6319;&#x52D5;&#x3082;POST&#x30EA;&#x30AF;&#x30A8;&#x30B9;&#x30C8;&#x3067;&#x306E;&#x5165;&#x529B;&#x5024;&#x304C;&#x8868;&#x793A;&#x3055;&#x308C;&#x308B;&#x90E8;&#x5206;&#x306B;&#x5B58;&#x5728;&#x3057;&#x3066;&#x3044;&#x305F;&#x3002;</p>
<h2 id="&#x8A8D;&#x5B9A;&#x5BFE;&#x8C61;&#x5916;&#x3068;&#x306A;&#x3063;&#x305F;&#x4E8B;&#x4F8B;">&#x8A8D;&#x5B9A;&#x5BFE;&#x8C61;&#x5916;&#x3068;&#x306A;&#x3063;&#x305F;&#x4E8B;&#x4F8B;</h2>
<h3 id="&#x30E2;&#x30CA;&#x30D0;&#x30B3;&#x306B;&#x8868;&#x793A;&#x3055;&#x308C;&#x308B;&#x30D7;&#x30ED;&#x30D5;&#x30A3;&#x30FC;&#x30EB;&#x540D;&#x3067;&#x306E;&#x4F8B;">&#x30E2;&#x30CA;&#x30D0;&#x30B3;&#x306B;&#x8868;&#x793A;&#x3055;&#x308C;&#x308B;&#x30D7;&#x30ED;&#x30D5;&#x30A3;&#x30FC;&#x30EB;&#x540D;&#x3067;&#x306E;&#x4F8B;</h3>
<p>&#x30E2;&#x30CA;&#x30D0;&#x30B3;&#x306E;&#x30A2;&#x30AB;&#x30A6;&#x30F3;&#x30C8;&#x306B;&#x306F;Twitter&#x30A2;&#x30AB;&#x30A6;&#x30F3;&#x30C8;&#x3068;&#x540C;&#x69D8;&#x306E;&#x30D7;&#x30ED;&#x30D5;&#x30A3;&#x30FC;&#x30EB;&#x540D;&#x3068;&#x30A2;&#x30A4;&#x30B3;&#x30F3;&#x753B;&#x50CF;&#x304C;&#x8A2D;&#x5B9A;&#x3055;&#x308C;&#x308B;&#x3002;&#x8A2D;&#x5B9A;&#x6642;&#x306E;API&#x30EA;&#x30AF;&#x30A8;&#x30B9;&#x30C8;&#x3092;&#x64CD;&#x4F5C;&#x3059;&#x308B;&#x3053;&#x3068;&#x3067;&#x3001;&#x30A2;&#x30A4;&#x30B3;&#x30F3;&#x753B;&#x50CF;&#x3067;&#x306F;<a href="https://gist.github.com/atsunoda/cf3523fbf1f444d0572ba543ec9d7bfa" target="_blank">401&#x30A4;&#x30F3;&#x30B8;&#x30A7;&#x30AF;&#x30B7;&#x30E7;&#x30F3;</a>&#x304C;&#x3001;&#x30D7;&#x30ED;&#x30D5;&#x30A3;&#x30FC;&#x30EB;&#x540D;&#x3067;&#x306F;&#x30C6;&#x30AD;&#x30B9;&#x30C8;&#x30A4;&#x30F3;&#x30B8;&#x30A7;&#x30AF;&#x30B7;&#x30E7;&#x30F3;&#x304C;&#x53EF;&#x80FD;&#x3067;&#x3042;&#x3063;&#x305F;&#x3002;Twitter&#x306E;&#x8868;&#x793A;&#x540D;&#x306B;&#x306F;<a href="https://help.twitter.com/ja/managing-your-account/change-twitter-handle" target="_blank">51&#x6587;&#x5B57;&#x4EE5;&#x4E0A;&#x3092;&#x8A2D;&#x5B9A;&#x3067;&#x304D;&#x306A;&#x3044;&#x4ED5;&#x69D8;</a>&#x3060;&#x304C;&#x3001;&#x30EA;&#x30AF;&#x30A8;&#x30B9;&#x30C8;&#x4E0A;&#x306E; <code>displayName</code> &#x3092;&#x4EE5;&#x4E0B;&#x306E;&#x3088;&#x3046;&#x306B;&#x64CD;&#x4F5C;&#x3059;&#x308B;&#x3068;51&#x6587;&#x5B57;&#x4EE5;&#x4E0A;&#x306E;&#x30D7;&#x30ED;&#x30D5;&#x30A3;&#x30FC;&#x30EB;&#x540D;&#x3092;&#x8A2D;&#x5B9A;&#x3067;&#x304D;&#x308B;&#x3002;</p>
<pre><code class="lang-diff"> POST /postOauthToken HTTP/1.1
 Host: api.monabako.com
 ...

<span class="hljs-deletion">-{&quot;token&quot;:&quot;98 ... PM&quot;,&quot;secret&quot;:&quot;xI ... sL&quot;,&quot;photoURL&quot;:&quot;https://abs.twimg.com/sticky/default_profile_images/default_profile_normal.png&quot;,&quot;displayName&quot;:&quot;Akaki Tsunoda&quot;}</span>
<span class="hljs-addition">+{&quot;token&quot;:&quot;98 ... PM&quot;,&quot;secret&quot;:&quot;xI ... sL&quot;,&quot;photoURL&quot;:&quot;https://abs.twimg.com/sticky/default_profile_images/default_profile_normal.png&quot;,&quot;displayName&quot;:&quot;\u79c1\u305f\u3061\u53cd\u4e71\u540c\u76df\u306f\u9280\u6cb3\u7cfb\u306e\u81ea\u7531\u306a\u5b58\u5728\u306e\u540d\u306e\u4e0b\u306b\u3001\u305d\u3057\u3066\u6a29\u5a01\u306b\u3088\u3063\u3066\u79c1\u305f\u3061\u306e\u610f\u56f3\u3092\u53b3\u7c9b\u306b\u516c\u8868\u3057\u5ba3\u8a00\u3057\u307e\u3059\u3002\u3000\u3000\u3000\u3000\u3000\u3000\u3000\u3000\u3000\u3000\u3000\u3000\u3000\u3000\u3000\u3000\u3000\u3000\u3000\u3000\u3000\u3000\u3000\u3000\u3000\u3000\u3000\u3000\u3000\u3000\u3000\u3000\u3000\u3000\u3000\u3000\u3000\u3000\u3000\u3000\u3000\u3000\u3000\u3000\u3000\u3000\u3000\u3000\u3000\u3000\u3000\u3000\u3000\u3000\u3000\u3042\u3089\u3086\u308b\u65b9\u6cd5\u3067\u3042\u306a\u305f\u3068\u3042\u306a\u305f\u306e\u529b\u306b\u5bfe\u6297\u3059\u308b\u3000\u3000\u3000\u3000\u3000\u3000\u3000\u3000\u3000\u3000\u3000\u3000\u3000\u3000\u81ea\u7531\u306a\u5b58\u5728\u306e\u6a29\u5229\u306b\u53cd\u3059\u308b\u3044\u304b\u306a\u308b\u5e1d\u56fd\u6cd5\u3082\u62d2\u5426\u3059\u308b\u3000\u3000\u3000\u3000\u3000\u3000\u3000\u3000\u3000\u3000\u3000\u3042\u306a\u305f\u306e\u7834\u58ca\u3068\u9280\u6cb3\u5e1d\u56fd\u306e\u7834\u58ca\u3092\u3082\u305f\u3089\u3059\u3000\u3000\u3000\u3000\u3000\u3000\u3000\u3000\u3000\u3000\u3000\u3000\u3000\u3000\u3000\u3000\u9280\u6cb3\u7cfb\u5185\u306e\u3059\u3079\u3066\u306e\u5b58\u5728\u3092\u6c38\u9060\u306b\u89e3\u653e\u3059\u308b\u3000\u3000\u3000\u3000\u3000\u3000\u3000\u3000\u3000\u3000\u3000\u3000\u3000\u3000\u3000\u3000\u3000\u3000\u3000\u3000\u3000\u3000\u3000\u3000\u3000\u3000\u3000\u3000\u3000\u3000\u3000\u3000\u3000\u3000\u3000\u3000\u3000\u3000\u3000\u3000\u3000\u3000\u3000\u3000\u3000\u3000\u3000\u3000\u3000\u3000\u3053\u308c\u3089\u306e\u76ee\u7684\u306e\u305f\u3081\u306b\u79c1\u305f\u3061\u306f\u79c1\u305f\u3061\u306e\u8ca1\u7523\u3001\u79c1\u305f\u3061\u306e\u540d\u8a89\u3001\u305d\u3057\u3066\u79c1\u305f\u3061\u306e\u751f\u6d3b\u3092\u8a93\u3044\u307e\u3059\u3002\u3000\u3000\u3000\u3000\u3000\u3000\u3000\u3000\u3000\u3000\u3000\u3000\u3000\u3000\u3000\u3000\u3000\u3000\u3000\u3000\u3000\u3000\u3000\u3000\u3000\u3000\u3000\u3000\u3000\u3000 ... \u3000&quot;}</span>
</code></pre>
<p>&#x3053;&#x308C;&#x306B;&#x3088;&#x308A;&#x672C;&#x6765;&#x30D7;&#x30ED;&#x30D5;&#x30A3;&#x30FC;&#x30EB;&#x540D;&#x304C;&#x8868;&#x793A;&#x3055;&#x308C;&#x308B;&#x90E8;&#x5206;&#x306B;&#x4EE5;&#x4E0B;&#x306E;&#x3088;&#x3046;&#x306A;&#x6587;&#x7AE0;&#x304C;&#x8868;&#x793A;&#x3055;&#x308C;&#x308B;<sup id="f1"><a href="#fn1">1</a></sup>&#x3002;&#x6539;&#x884C;&#x306F;&#x3067;&#x304D;&#x306A;&#x3044;&#x305F;&#x3081;&#x5168;&#x89D2;&#x30B9;&#x30DA;&#x30FC;&#x30B9; <code>\u3000</code> &#x306B;&#x3088;&#x308A;&#x30A4;&#x30F3;&#x30C7;&#x30F3;&#x30C8;&#x3092;&#x8ABF;&#x6574;&#x3057;&#x3066;&#x3044;&#x308B;&#x3002;</p>
<p><img src="https://user-images.githubusercontent.com/5434303/50735635-a9816500-11f5-11e9-95db-07cf58bffd24.png" alt="monabako"></p>
<p>&#x653B;&#x6483;&#x8005;&#x306B;&#x3088;&#x3063;&#x3066;&#x5DEE;&#x5225;&#x7684;&#x8868;&#x73FE;&#x3084;&#x5B97;&#x6559;&#x7684;&#x8868;&#x73FE;&#x3092;&#x542B;&#x3080;&#x6587;&#x7AE0;&#x3092;&#x66F8;&#x304D;&#x8FBC;&#x307E;&#x308C;&#x3001;&#x305D;&#x306E;&#x30DA;&#x30FC;&#x30B8;&#x3092;SNS&#x3067;&#x62E1;&#x6563;&#x3055;&#x308C;&#x305F;&#x5834;&#x5408;&#x306B;&#x30B5;&#x30FC;&#x30D3;&#x30B9;&#x306E;&#x30A4;&#x30E1;&#x30FC;&#x30B8;&#x4F4E;&#x4E0B;&#x306A;&#x3069;&#x306E;&#x98A8;&#x8A55;&#x88AB;&#x5BB3;&#x306B;&#x3064;&#x306A;&#x304C;&#x308B;&#x6050;&#x308C;&#x304C;&#x3042;&#x308B;&#x3068;&#x5831;&#x544A;&#x3057;&#x305F;&#x304C;&#x3001;&#x8106;&#x5F31;&#x6027;&#x3068;&#x3057;&#x3066;&#x8A8D;&#x5B9A;&#x3055;&#x308C;&#x306A;&#x304B;&#x3063;&#x305F;&#x3002;&#x8A55;&#x4FA1;&#x7406;&#x7531;&#x306B;&#x3064;&#x3044;&#x3066;&#x30E2;&#x30CA;&#x30D0;&#x30B3;&#x306F;&#x300C;&#x672C;&#x4EF6;&#x306F;&#x8106;&#x5F31;&#x6027;&#x3067;&#x306F;&#x306A;&#x304F;&#x904B;&#x7528;&#x306E;&#x554F;&#x984C;&#x300D;&#x3068;&#x8FF0;&#x3079;&#x3066;&#x3044;&#x308B;&#x3002;</p>
<h3 id="&#x30B5;&#x30A4;&#x30DC;&#x30A6;&#x30BA;&#x304B;&#x3089;&#x9001;&#x4FE1;&#x3055;&#x308C;&#x308B;&#x30E1;&#x30FC;&#x30EB;&#x306E;&#x5B9B;&#x540D;&#x3067;&#x306E;&#x4F8B;">&#x30B5;&#x30A4;&#x30DC;&#x30A6;&#x30BA;&#x304B;&#x3089;&#x9001;&#x4FE1;&#x3055;&#x308C;&#x308B;&#x30E1;&#x30FC;&#x30EB;&#x306E;&#x5B9B;&#x540D;&#x3067;&#x306E;&#x4F8B;</h3>
<p>cybozu.com&#x5171;&#x901A;&#x7BA1;&#x7406;&#x306E;&#x304A;&#x554F;&#x3044;&#x5408;&#x308F;&#x305B;&#x30D5;&#x30A9;&#x30FC;&#x30E0;&#x3067;&#x306F;&#x3001;&#x6295;&#x7A3F;&#x6642;&#x306B;&#x6307;&#x5B9A;&#x3057;&#x305F;&#x30E1;&#x30FC;&#x30EB;&#x30A2;&#x30C9;&#x30EC;&#x30B9;&#x5B9B;&#x306B;&#x53D7;&#x4ED8;&#x30E1;&#x30FC;&#x30EB;&#x304C;&#x9001;&#x4FE1;&#x3055;&#x308C;&#x3066;&#x304A;&#x308A;&#x3001;&#x30E1;&#x30FC;&#x30EB;&#x672C;&#x6587;&#x306B;&#x306F;&#x5165;&#x529B;&#x3057;&#x305F;&#x5B9B;&#x540D;&#xFF08;&#x6240;&#x5C5E;&#x7D44;&#x7E54;&#x3068;&#x500B;&#x4EBA;&#x540D;&#xFF09;&#x304C;&#x542B;&#x307E;&#x308C;&#x3066;&#x3044;&#x305F;&#x3002;&#x305D;&#x306E;&#x305F;&#x3081;&#x6295;&#x7A3F;&#x6642;&#x306E;&#x30EA;&#x30AF;&#x30A8;&#x30B9;&#x30C8;&#x3092;&#x4EE5;&#x4E0B;&#x306E;&#x3088;&#x3046;&#x306B;&#x64CD;&#x4F5C;&#x3059;&#x308B;&#x3053;&#x3068;&#x3067;&#x3001;&#x30E1;&#x30FC;&#x30EB;&#x672C;&#x6587;&#x306B;&#x6587;&#x7AE0;&#x3092;&#x8FFD;&#x8A18;&#x3067;&#x304D;&#x308B;&#x72B6;&#x614B;&#x3060;&#x3063;&#x305F;&#x3002;</p>
<pre><code class="lang-diff"> POST /api/support/question.json?_lc=en-US HTTP/1.1
 Host: &#x25A0;&#x25A0;&#x25A0;&#x25A0;&#x25A0;&#x25A0;&#x25A0;&#x25A0;&#x25A0;&#x25A0;&#x25A0;&#x25A0;&#x25A0;&#x25A0;&#x25A0;&#x25A0;&#x25A0;&#x25A0;&#x25A0;&#x25A0;.cybozu-dev.com
 Accept-Language: en-US;q=0.7,en;q=0.3
 ...

<span class="hljs-deletion">-{&quot;type&quot;:&quot;question&quot;,&quot;questionService&quot;:&quot;garoon&quot;,&quot;questionFeature&quot;:&quot;-&quot;,&quot;questionBody&quot;:&quot;-&quot;,&quot;questionFile&quot;:&quot;46 ... 37&quot;,&quot;commonCompany&quot;:&quot;Paranoid&quot;,&quot;commonPerson&quot;:&quot;Akaki Tsunoda&quot;,&quot;commonEmail&quot;:&quot;&#x25A0;&#x25A0;&#x25A0;&#x25A0;&#x25A0;&#x25A0;&#x25A0;&#x25A0;&#x25A0;@gmail.com&quot;,&quot;__REQUEST_TOKEN__&quot;:&quot;92 ... 58&quot;}</span>
<span class="hljs-addition">+{&quot;type&quot;:&quot;question&quot;,&quot;questionService&quot;:&quot;garoon&quot;,&quot;questionFeature&quot;:&quot;-&quot;,&quot;questionBody&quot;:&quot;-&quot;,&quot;questionFile&quot;:&quot;46 ... 37&quot;,&quot;commonCompany&quot;:&quot;\u96fb\u8133 \u574a\u4e3b \u69d8\r\n\r\n\u3044\u3064\u3082\u304a\u4e16\u8a71\u306b\u306a\u3063\u3066\u304a\u308a\u307e\u3059\u3002\r\n\u30b5\u30a4\u30dc\u30a6\u30ba\u682a\u5f0f\u4f1a\u793e \u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u4e8b\u52d9\u5c40\u3067\u3059\u3002\r\n\r\n\u3054\u5229\u7528\u4e2d\u306e\u30a2\u30ab\u30a6\u30f3\u30c8\u304c\u4e0d\u6b63\u30a2\u30af\u30bb\u30b9\u3092\u53d7\u3051\u3066\u3044\u307e\u3059\u3002\r\n\r\n\u8a73\u7d30\u72b6\u6cc1\u3092\u8a18\u8f09\u3057\u305f\u30d5\u30a1\u30a4\u30eb\u3092\u6dfb\u4ed8\u3057\u3066\u304a\u308a\u307e\u3059\u306e\u3067\u3054\u78ba\u8a8d\u304f\u3060\u3055\u3044\u3002&quot;,&quot;commonPerson&quot;:&quot;: \u96fb\u8133 \u574a\u4e3b\r\nFile : \u4e0d\u6b63\u30a2\u30af\u30bb\u30b9\u72b6\u6cc1.docx\r\n\r\n-----------------------\r\n\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u4e8b\u52d9\u5c40\r\nsecurity@cybozu.com\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n&quot;,&quot;commonEmail&quot;:&quot;&#x25A0;&#x25A0;&#x25A0;&#x25A0;&#x25A0;&#x25A0;&#x25A0;&#x25A0;&#x25A0;@gmail.com&quot;,&quot;__REQUEST_TOKEN__&quot;:&quot;92 ... 58&quot;}</span>
</code></pre>
<p>&#x3053;&#x308C;&#x306B;&#x3088;&#x308A;&#x4EE5;&#x4E0B;&#x306E;&#x3088;&#x3046;&#x306A;&#x53D7;&#x4ED8;&#x30E1;&#x30FC;&#x30EB;&#x304C;&#x6307;&#x5B9A;&#x306E;&#x30E1;&#x30FC;&#x30EB;&#x30A2;&#x30C9;&#x30EC;&#x30B9;&#x5B9B;&#x306B;&#x9001;&#x4FE1;&#x3055;&#x308C;&#x308B;&#x3002;&#x64CD;&#x4F5C;&#x3057;&#x305F;&#x6240;&#x5C5E;&#x7D44;&#x7E54;&#xFF08;<code>commonCompany</code>&#xFF09;&#x306F;&#x6587;&#x982D;&#x306E;&#x9EC4;&#x8272;&#x3044;&#x90E8;&#x5206;&#x3001;&#x500B;&#x4EBA;&#x540D;&#xFF08;<code>commonPerson</code>&#xFF09;&#x306F; <code>To</code> &#x4EE5;&#x964D;&#x306E;&#x30AA;&#x30EC;&#x30F3;&#x30B8;&#x8272;&#x306E;&#x90E8;&#x5206;&#x306B;&#x51FA;&#x529B;&#x3055;&#x308C;&#x3066;&#x3044;&#x308B;&#x3002;&#x500B;&#x4EBA;&#x540D;&#x306E;&#x5F8C;&#x65B9;&#x306B;&#x8907;&#x6570;&#x306E;&#x6539;&#x884C;&#x3092;&#x542B;&#x3081;&#x308B;&#x3053;&#x3068;&#x3067;&#x672C;&#x6765;&#x306E;&#x5B9A;&#x578B;&#x6587;&#x3092;&#x4E0B;&#x306B;&#x8FFD;&#x3044;&#x3084;&#x3063;&#x3066;&#x3044;&#x308B;&#x3002;</p>
<p><img src="https://user-images.githubusercontent.com/5434303/50735480-2ced8700-11f3-11e9-98f7-065d4accc636.png" alt="cybozu"></p>
<p>&#x6295;&#x7A3F;&#x6642;&#x306E;&#x30EA;&#x30AF;&#x30A8;&#x30B9;&#x30C8;&#x306B;&#x542B;&#x307E;&#x308C;&#x308B;GET&#x30D1;&#x30E9;&#x30E1;&#x30FC;&#x30BF; <code>_lc</code> &#x3068;Accept-Language&#x30D8;&#x30C3;&#x30C0;&#x306E;&#x5024;&#x3092;&#x64CD;&#x4F5C;&#x3059;&#x308B;&#x3053;&#x3068;&#x3067;&#x3001;&#x53D7;&#x4ED8;&#x30E1;&#x30FC;&#x30EB;&#x306E;&#x30BF;&#x30A4;&#x30C8;&#x30EB;&#x3068;&#x5B9A;&#x578B;&#x6587;&#x3092;&#x82F1;&#x8A9E;&#x306B;&#x5909;&#x66F4;&#x3067;&#x304D;&#x308B;&#x3002;&#x305D;&#x306E;&#x305F;&#x3081;&#x6A19;&#x7684;&#x3068;&#x306A;&#x3063;&#x305F;&#x65E5;&#x672C;&#x4EBA;&#x306F;&#x82F1;&#x8A9E;&#x306E;&#x30BF;&#x30A4;&#x30C8;&#x30EB;&#x3084;&#x5B9A;&#x578B;&#x6587;&#x3092;&#x8AAD;&#x307F;&#x98DB;&#x3070;&#x3057;&#x3001;&#x4E0D;&#x6B63;&#x306B;&#x8FFD;&#x8A18;&#x3055;&#x308C;&#x305F;&#x65E5;&#x672C;&#x8A9E;&#x306E;&#x6587;&#x7AE0;&#x306B;&#x6CE8;&#x76EE;&#x3059;&#x308B;&#x53EF;&#x80FD;&#x6027;&#x304C;&#x9AD8;&#x3044;&#x3002;&#x3055;&#x3089;&#x306B;&#x304A;&#x554F;&#x3044;&#x5408;&#x308F;&#x305B;&#x30D5;&#x30A9;&#x30FC;&#x30E0;&#x3067;&#x306F;&#x4EFB;&#x610F;&#x306E;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x3092;&#x30A2;&#x30C3;&#x30D7;&#x30ED;&#x30FC;&#x30C9;&#x3067;&#x304D;&#x3001;&#x53D7;&#x4ED8;&#x30E1;&#x30FC;&#x30EB;&#x306B;&#x306F;&#x30A2;&#x30C3;&#x30D7;&#x30ED;&#x30FC;&#x30C9;&#x3057;&#x305F;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x304C;&#x6DFB;&#x4ED8;&#x3055;&#x308C;&#x308B;&#x3002;&#x653B;&#x6483;&#x8005;&#x306F;&#x4E0D;&#x6B63;&#x306A;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x3092;&#x30A2;&#x30C3;&#x30D7;&#x30ED;&#x30FC;&#x30C9;&#x3057;&#x3001;&#x88AB;&#x5BB3;&#x8005;&#x306E;&#x30E1;&#x30FC;&#x30EB;&#x30A2;&#x30C9;&#x30EC;&#x30B9;&#x3092;&#x6307;&#x5B9A;&#x3057;&#x305F;&#x4E0D;&#x6B63;&#x306A;&#x304A;&#x554F;&#x3044;&#x5408;&#x308F;&#x305B;&#x3092;&#x6295;&#x7A3F;&#x3059;&#x308B;&#x3053;&#x3068;&#x3067;&#x3001;&#x4E0A;&#x8A18;&#x306E;&#x3088;&#x3046;&#x306A;&#x30E1;&#x30FC;&#x30EB;&#x3092;&#x88AB;&#x5BB3;&#x8005;&#x306B;&#x9001;&#x308A;&#x3064;&#x3051;&#x3089;&#x308C;&#x308B;&#x72B6;&#x614B;&#x3060;&#x3063;&#x305F;&#x3002;</p>
<p>&#x30B5;&#x30A4;&#x30DC;&#x30A6;&#x30BA;&#x306F;&#x3053;&#x306E;&#x5831;&#x544A;&#x3092;&#x53D7;&#x3051;&#x3001;&#x4E0D;&#x6B63;&#x306A;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x3092;&#x9001;&#x308A;&#x3064;&#x3051;&#x3089;&#x308C;&#x308B;&#x70B9;&#x306E;&#x307F;&#x3092;<a href="https://kb.cybozu.support/article/33076/" target="_blank">CyVDB-1647</a>&#x3067;&#x8A8D;&#x5B9A;&#x3057;&#x3001;&#x30E1;&#x30FC;&#x30EB;&#x672C;&#x6587;&#x3092;&#x66F8;&#x304D;&#x63DB;&#x3048;&#x3089;&#x308C;&#x308B;&#x70B9;&#x306F;&#x300C;&#x30BF;&#x30A4;&#x30C8;&#x30EB;&#x306F;&#x5909;&#x66F4;&#x3055;&#x308C;&#x305A;&#x30E1;&#x30FC;&#x30EB;&#x672C;&#x6587;&#x306E;&#x6587;&#x8A00;&#x3082;&#x5931;&#x3046;&#x308F;&#x3051;&#x3067;&#x306F;&#x306A;&#x3044;&#x305F;&#x3081;&#x3001;&#x8106;&#x5F31;&#x6027;&#x3068;&#x3057;&#x3066;&#x8003;&#x3048;&#x3066;&#x3044;&#x306A;&#x3044;&#x300D;&#x3068;&#x306E;&#x7406;&#x7531;&#x3067;&#x8A8D;&#x5B9A;&#x5BFE;&#x8C61;&#x5916;&#x3068;&#x3057;&#x305F;&#x3002;&#x305D;&#x306E;&#x5F8C;&#x30B5;&#x30A4;&#x30DC;&#x30A6;&#x30BA;&#x306F;cybozu.com&#x5171;&#x901A;&#x7BA1;&#x7406;&#x306E;&#x304A;&#x554F;&#x3044;&#x5408;&#x308F;&#x305B;&#x30D5;&#x30A9;&#x30FC;&#x30E0;&#x3092;&#x5EC3;&#x6B62;&#x3057;&#x305F;&#x3002;</p>
<h2 id="spotify&#x306B;&#x304A;&#x3051;&#x308B;&#x5B9F;&#x4F8B;">Spotify&#x306B;&#x304A;&#x3051;&#x308B;&#x5B9F;&#x4F8B;</h2>
<p>&#x4E00;&#x822C;&#x7684;&#x306A;&#x30B5;&#x30A4;&#x30C8;&#x306E;&#x691C;&#x7D22;&#x6A5F;&#x80FD;&#x3067;&#x306F;&#x5165;&#x529B;&#x3057;&#x305F;&#x691C;&#x7D22;&#x30EF;&#x30FC;&#x30C9;&#x304C;&#x691C;&#x7D22;&#x7D50;&#x679C;&#x30DA;&#x30FC;&#x30B8;&#x306B;&#x8868;&#x793A;&#x3055;&#x308C;&#x308B;&#x3002;&#x305D;&#x306E;&#x8868;&#x793A;&#x65B9;&#x6CD5;&#x306B;&#x3088;&#x3063;&#x3066;&#x306F;&#x30C6;&#x30AD;&#x30B9;&#x30C8;&#x30A4;&#x30F3;&#x30B8;&#x30A7;&#x30AF;&#x30B7;&#x30E7;&#x30F3;&#x306E;&#x5F71;&#x97FF;&#x3092;&#x53D7;&#x3051;&#x308B;&#x53EF;&#x80FD;&#x6027;&#x304C;&#x3042;&#x308B;&#x3002;&#x305D;&#x306E;&#x4E00;&#x4F8B;&#x3092;&#x7D39;&#x4ECB;&#x3059;&#x308B;&#x3002;</p>
<p><a href="https://developer.spotify.com/" target="_blank">Spotify&#x306E;&#x958B;&#x767A;&#x8005;&#x5411;&#x3051;&#x30B5;&#x30A4;&#x30C8;</a>&#x3067;&#x306F;&#x691C;&#x7D22;&#x30D5;&#x30A9;&#x30FC;&#x30E0;&#x304C;&#x80CC;&#x666F;&#x3068;&#x4E00;&#x4F53;&#x306B;&#x8868;&#x793A;&#x3055;&#x308C;&#x3066;&#x304A;&#x308A;&#x3001;&#x304B;&#x3064;&#x691C;&#x7D22;&#x30EF;&#x30FC;&#x30C9;&#x304C;&#x5F37;&#x8ABF;&#x3055;&#x308C;&#x308B;UI&#x30C7;&#x30B6;&#x30A4;&#x30F3;&#x306B;&#x306A;&#x3063;&#x3066;&#x3044;&#x308B;&#x3002;&#x305D;&#x306E;&#x305F;&#x3081;&#x4EE5;&#x4E0B;&#x306E;&#x3088;&#x3046;&#x306A;&#x691C;&#x7D22;&#x30EF;&#x30FC;&#x30C9;&#x306F;Spotify&#x304B;&#x3089;&#x306E;&#x516C;&#x5F0F;&#x30E1;&#x30C3;&#x30BB;&#x30FC;&#x30B8;&#x3068;&#x8AA4;&#x8A8D;&#x3055;&#x308C;&#x308B;&#x53EF;&#x80FD;&#x6027;&#x304C;&#x3042;&#x308B;&#x3002;</p>
<p>hxxps://developer.spotify.com/?query=evil.com%20%E3%81%AB%E7%A7%BB%E8%A1%8C%E3%81%97%E3%81%BE%E3%81%97%E3%81%9F%E3%80%82</p>
<p><img src="https://user-images.githubusercontent.com/5434303/50736303-501e3380-11ff-11e9-9687-7b5273a63ce0.png" alt="spotify"></p>
<p>&#x653B;&#x6483;&#x8005;&#x306B;&#x3088;&#x3063;&#x3066;&#x62E1;&#x6563;&#x3055;&#x308C;&#x305F;URL&#x304B;&#x3089;&#x30A2;&#x30AF;&#x30BB;&#x30B9;&#x3057;&#x305F;&#x88AB;&#x5BB3;&#x8005;&#x304C;&#x5916;&#x90E8;&#x30B5;&#x30A4;&#x30C8;&#x3078;&#x8A98;&#x5C0E;&#x3055;&#x308C;&#x308B;&#x6050;&#x308C;&#x306A;&#x3069;&#x304C;&#x8003;&#x3048;&#x3089;&#x308C;&#x308B;&#x3002;&#x3057;&#x304B;&#x3057;Spotify&#x306E;&#x30B5;&#x30A4;&#x30C8;&#x3067;&#x306F;&#x691C;&#x7D22;&#x30EF;&#x30FC;&#x30C9;&#x306E;&#x8868;&#x793A;&#x5E45;&#x304C;&#x72ED;&#x3044;&#x305F;&#x3081;&#x9577;&#x6587;&#x306F;&#x8868;&#x793A;&#x3067;&#x304D;&#x305A;&#x3001;&#x6539;&#x884C;&#x3082;&#x3067;&#x304D;&#x306A;&#x3044;&#x3002;&#x3053;&#x308C;&#x4EE5;&#x4E0A;&#x306E;&#x8A73;&#x7D30;&#x306A;&#x6587;&#x7AE0;&#x306F;&#x8868;&#x793A;&#x3067;&#x304D;&#x306A;&#x3044;&#x305F;&#x3081;&#x5B9F;&#x969B;&#x306B;&#x60AA;&#x7528;&#x3055;&#x308C;&#x308B;&#x53EF;&#x80FD;&#x6027;&#x306F;&#x4F4E;&#x3044;&#x3002;&#x306A;&#x304A;<a href="https://hackerone.com/spotify" target="_blank">Spotify&#x306E;&#x8106;&#x5F31;&#x6027;&#x5831;&#x5968;&#x91D1;&#x5236;&#x5EA6;</a>&#x306F;&#x30C6;&#x30AD;&#x30B9;&#x30C8;&#x30A4;&#x30F3;&#x30B8;&#x30A7;&#x30AF;&#x30B7;&#x30E7;&#x30F3;&#x3092;&#x8A8D;&#x5B9A;&#x5BFE;&#x8C61;&#x5916;&#x3068;&#x3057;&#x3066;&#x3044;&#x308B;&#x305F;&#x3081;&#x3001;&#x3053;&#x306E;&#x6319;&#x52D5;&#x306F;Spotify&#x306B;&#x5831;&#x544A;&#x3057;&#x3066;&#x3044;&#x306A;&#x3044;<sup id="f2"><a href="#fn2">2</a></sup>&#x3002;</p>
<h2 id="withinsecurity&#x3067;&#x306E;&#x597D;&#x4E8B;&#x4F8B;">withinsecurity&#x3067;&#x306E;&#x597D;&#x4E8B;&#x4F8B;</h2>
<p>HackerOne&#x30D6;&#x30ED;&#x30B0;&#x306E;&#x524D;&#x8EAB;&#x3067;&#x3042;&#x308B;<a href="https://hackerone.com/withinsecurity" target="_blank">withinsecurity</a>&#x306E;&#x30B5;&#x30A4;&#x30C8;&#x306F;WordPress&#x3067;&#x5B9F;&#x88C5;&#x3055;&#x308C;&#x3066;&#x304A;&#x308A;&#x3001;WP&#x7BA1;&#x7406;&#x8005;&#x306E;&#x30ED;&#x30B0;&#x30A4;&#x30F3;&#x30DA;&#x30FC;&#x30B8;&#x306B;&#x8868;&#x793A;&#x3055;&#x308C;&#x308B;&#x30A8;&#x30E9;&#x30FC;&#x30E1;&#x30C3;&#x30BB;&#x30FC;&#x30B8;&#x3092;GET&#x30D1;&#x30E9;&#x30E1;&#x30FC;&#x30BF;&#x3067;&#x53D7;&#x3051;&#x53D6;&#x3063;&#x3066;&#x3044;&#x305F;&#x3002;&#x305D;&#x306E;&#x305F;&#x3081;<a href="https://hackerone.com/reports/111094" target="_blank">#111094</a>&#x306F;&#x4EE5;&#x4E0B;&#x306E;&#x3088;&#x3046;&#x306A;URL&#x306B;&#x3088;&#x308A;&#x30A8;&#x30E9;&#x30FC;&#x30E1;&#x30C3;&#x30BB;&#x30FC;&#x30B8;&#x3092;&#x6539;&#x3056;&#x3093;&#x3059;&#x308B;&#x3053;&#x3068;&#x3067;&#x8106;&#x5F31;&#x6027;&#x3068;&#x3057;&#x3066;&#x8A8D;&#x5B9A;&#x3055;&#x308C;&#x3066;&#x3044;&#x308B;&#x3002;</p>
<p>hxxps://example.com/wp-login.php?error=Your%20account%20has%20been%20hacked%2C%20Please%20call%20us%20this%20number%2003-9999-0000%20OR%20Drop%20mail%20at%20oscar%40evil.com</p>
<p><img src="https://user-images.githubusercontent.com/5434303/50736253-6e376400-11fe-11e9-994c-ea01c1dbb31f.png" alt="withinsecurity"></p>
<p>&#x3053;&#x306E;&#x4F8B;&#x3067;&#x306F;&#x653B;&#x6483;&#x8005;&#x304C;&#x7D30;&#x5DE5;&#x3057;&#x305F;URL&#x304B;&#x3089;&#x30ED;&#x30B0;&#x30A4;&#x30F3;&#x30DA;&#x30FC;&#x30B8;&#x306B;&#x30A2;&#x30AF;&#x30BB;&#x30B9;&#x3057;&#x305F;&#x88AB;&#x5BB3;&#x8005;&#x304C;&#x8105;&#x8FEB;&#x3055;&#x308C;&#x3066;&#x3044;&#x308B;&#x3002;&#x4ED6;&#x306B;&#x3082;&#x88AB;&#x5BB3;&#x8005;&#x304C;&#x507D;&#x306E;&#x30ED;&#x30B0;&#x30A4;&#x30F3;&#x30DA;&#x30FC;&#x30B8;&#x306B;&#x8A98;&#x5C0E;&#x3055;&#x308C;&#x308B;&#x6050;&#x308C;&#x306A;&#x3069;&#x304C;&#x8003;&#x3048;&#x3089;&#x308C;&#x308B;&#x3002;</p>
<h2 id="&#x6240;&#x611F;">&#x6240;&#x611F;</h2>
<p>&#x30C6;&#x30AD;&#x30B9;&#x30C8;&#x30A4;&#x30F3;&#x30B8;&#x30A7;&#x30AF;&#x30B7;&#x30E7;&#x30F3;&#x306E;&#x60AA;&#x7528;&#x306B;&#x306F;&#x30D5;&#x30A3;&#x30C3;&#x30B7;&#x30F3;&#x30B0;&#x306E;&#x8981;&#x7D20;&#x304C;&#x6C42;&#x3081;&#x3089;&#x308C;&#x308B;&#x305F;&#x3081;&#x3001;&#x30A2;&#x30D7;&#x30EA;&#x30B1;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x306E;&#x8106;&#x5F31;&#x6027;&#x3068;&#x3057;&#x3066;&#x8A8D;&#x5B9A;&#x3055;&#x308C;&#x306A;&#x3044;&#x30B1;&#x30FC;&#x30B9;&#x304C;&#x591A;&#x3044;&#x3002;&#x30E2;&#x30CA;&#x30D0;&#x30B3;&#x306F;Q&amp;A&#x30B5;&#x30FC;&#x30D3;&#x30B9;&#x3067;&#x3042;&#x308B;&#x305F;&#x3081;&#x6587;&#x7AE0;&#x3092;&#x66F8;&#x304D;&#x8FBC;&#x3081;&#x308B;&#x4ED5;&#x69D8;&#x304C;&#x3042;&#x308A;&#x3001;&#x653B;&#x6483;&#x8005;&#x306F;&#x30C6;&#x30AD;&#x30B9;&#x30C8;&#x30A4;&#x30F3;&#x30B8;&#x30A7;&#x30AF;&#x30B7;&#x30E7;&#x30F3;&#x3092;&#x4F7F;&#x3046;&#x3053;&#x3068;&#x306A;&#x304F;&#x4E0D;&#x9069;&#x5207;&#x306A;&#x6587;&#x7AE0;&#x3092;&#x66F8;&#x304D;&#x8FBC;&#x3081;&#x308B;&#x305F;&#x3081;&#x3001;&#x904B;&#x55B6;&#x5074;&#x306E;&#x300C;&#x8106;&#x5F31;&#x6027;&#x3067;&#x306F;&#x306A;&#x304F;&#x904B;&#x7528;&#x306E;&#x554F;&#x984C;&#x300D;&#x3068;&#x3044;&#x3046;&#x8A55;&#x4FA1;&#x306F;&#x7406;&#x89E3;&#x3067;&#x304D;&#x308B;&#x3002;&#x3082;&#x3057;&#x6587;&#x7AE0;&#x3092;&#x66F8;&#x304D;&#x8FBC;&#x3081;&#x308B;&#x4ED5;&#x69D8;&#x304C;&#x306A;&#x3044;&#x30B5;&#x30A4;&#x30C8;&#x3067;&#x3042;&#x308C;&#x3070;&#x3001;&#x30C6;&#x30AD;&#x30B9;&#x30C8;&#x30A4;&#x30F3;&#x30B8;&#x30A7;&#x30AF;&#x30B7;&#x30E7;&#x30F3;&#x306B;&#x3088;&#x308A;&#x30D5;&#x30A3;&#x30C3;&#x30B7;&#x30F3;&#x30B0;&#x3084;&#x4E0D;&#x6B63;&#x306A;&#x5BA3;&#x4F1D;&#x884C;&#x70BA;&#x306B;&#x60AA;&#x7528;&#x3055;&#x308C;&#x308B;&#x3060;&#x3051;&#x3067;&#x306A;&#x304F;&#x3001;&#x30D8;&#x30A4;&#x30C8;&#x30B9;&#x30D4;&#x30FC;&#x30C1;&#x3092;&#x66F8;&#x304D;&#x8FBC;&#x307E;&#x308C;&#x3066;<a href="https://www.asahi.com/articles/ASL574TCQL57UOOB007.html" target="_blank">&#x9577;&#x91CE;&#x770C;&#x653F;&#x306E;&#x3088;&#x3046;&#x306B;&#x6279;&#x5224;&#x3092;&#x6D74;&#x3073;&#x308B;</a>&#x6050;&#x308C;&#x3082;&#x3042;&#x3063;&#x305F;&#x3002;</p>
<p>&#x91CD;&#x8981;&#x60C5;&#x5831;&#x3092;&#x6271;&#x3046;&#x30B5;&#x30A4;&#x30C8;&#x3084;&#x30A2;&#x30D7;&#x30EA;&#x30B1;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x3067;&#x306F;&#x30D5;&#x30A3;&#x30C3;&#x30B7;&#x30F3;&#x30B0;&#x306B;&#x3088;&#x308B;&#x88AB;&#x5BB3;&#x306E;&#x5F71;&#x97FF;&#x304C;&#x5927;&#x304D;&#x3044;&#x305F;&#x3081;&#x3001;withinsecurity&#x306F;&#x30C6;&#x30AD;&#x30B9;&#x30C8;&#x30A4;&#x30F3;&#x30B8;&#x30A7;&#x30AF;&#x30B7;&#x30E7;&#x30F3;&#x3092;&#x8106;&#x5F31;&#x6027;&#x3068;&#x3057;&#x3066;&#x8A8D;&#x5B9A;&#x3057;&#x305F;&#x3068;&#x63A8;&#x6E2C;&#x3059;&#x308B;&#x3002;&#x6700;&#x8FD1;&#x3067;&#x306F;&#x3001;Bitcoin&#x30A6;&#x30A9;&#x30EC;&#x30C3;&#x30C8;&#x3068;&#x3057;&#x3066;&#x6709;&#x540D;&#x306A;<a href="https://electrum.org" target="_blank">Electrum</a>&#x306E;<a href="https://github.com/spesmilo/electrum/issues/4968" target="_blank">&#x30A8;&#x30E9;&#x30FC;&#x30E1;&#x30C3;&#x30BB;&#x30FC;&#x30B8;&#x304C;&#x30BB;&#x30AD;&#x30E5;&#x30EA;&#x30C6;&#x30A3;&#x30A2;&#x30C3;&#x30D7;&#x30C7;&#x30FC;&#x30C8;&#x306B;&#x507D;&#x88C5;&#x3055;&#x308C;&#x30DE;&#x30EB;&#x30A6;&#x30A7;&#x30A2;&#x3078;&#x8A98;&#x5C0E;&#x3055;&#x308C;&#x3066;&#x3044;&#x305F;</a>&#x3088;&#x3046;&#x306B;&#x3001;&#x30A2;&#x30D7;&#x30EA;&#x30B1;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x306E;&#x30E1;&#x30C3;&#x30BB;&#x30FC;&#x30B8;&#x3092;&#x507D;&#x88C5;&#x3057;&#x305F;&#x30D5;&#x30A3;&#x30C3;&#x30B7;&#x30F3;&#x30B0;&#x3082;&#x8D77;&#x304D;&#x3066;&#x3044;&#x308B;&#x3002;&#x30C6;&#x30AD;&#x30B9;&#x30C8;&#x30A4;&#x30F3;&#x30B8;&#x30A7;&#x30AF;&#x30B7;&#x30E7;&#x30F3;&#x3092;&#x4E00;&#x6982;&#x306B;&#x300C;&#x8106;&#x5F31;&#x6027;&#x3067;&#x306F;&#x306A;&#x3044;&#x300D;&#x3068;&#x8A55;&#x4FA1;&#x3059;&#x308B;&#x306E;&#x3067;&#x306F;&#x306A;&#x304F;&#x3001;&#x653B;&#x6483;&#x30B7;&#x30CA;&#x30EA;&#x30AA;&#x306E;&#x73FE;&#x5B9F;&#x6027;&#x3084;&#x5229;&#x7528;&#x8005;&#x3078;&#x306E;&#x5F71;&#x97FF;&#x5EA6;&#x3092;&#x8003;&#x616E;&#x3057;&#x3066;&#x8A55;&#x4FA1;&#x3059;&#x308B;&#x306E;&#x304C;&#x671B;&#x307E;&#x3057;&#x3044;&#x3002;</p>
<hr>
<p><sup id="fn1"><a href="#f1">1</a></sup> &#x3053;&#x306E;&#x6587;&#x7AE0;&#x306F;<a href="http://starwars.wikia.com/wiki/Declaration_of_Rebellion#Full_text" target="_blank">Wookieepedia, the Star Wars Wiki</a>&#x306B;&#x3042;&#x308B;&#x53CD;&#x4E71;&#x5BA3;&#x8A00;&#x306E;&#x4E00;&#x90E8;&#x3092;Google&#x7FFB;&#x8A33;&#x3057;&#x305F;&#x3082;&#x306E;&#x3067;&#x3042;&#x308B;&#x3002;<br><sup id="fn2"><a href="#f2">2</a></sup> &#x8A8D;&#x5B9A;&#x5BFE;&#x8C61;&#x5916;&#x3068;&#x660E;&#x8A18;&#x3055;&#x308C;&#x3066;&#x3044;&#x308B;&#x8106;&#x5F31;&#x6027;&#x3092;&#x5831;&#x544A;&#x3059;&#x308B;&#x3068;<a href="https://docs.hackerone.com/hackers/reputation.html" target="_blank">HackerOne&#x4E0A;&#x306E;Reputation</a>&#x304C;&#x6E1B;&#x70B9;&#x3055;&#x308C;&#x308B;&#x53EF;&#x80FD;&#x6027;&#x304C;&#x9AD8;&#x3044;&#x3002;  </p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="hackedu.html" class="navigation navigation-prev " aria-label="Previous page: HackerOneに報告された脆弱性をHackEDUで再現する">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="../#2018" class="navigation navigation-next " aria-label="Next page: 2018">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"脆弱性報奨金制度で認定されづらいテキストインジェクション","level":"2.1.4","depth":2,"next":{"title":"2018","level":"2.2","depth":1,"anchor":"#2018","path":"README.md","ref":"README.md#2018","articles":[{"title":"Request-URIのパスからのオープンリダイレクト 実践編","level":"2.2.1","depth":2,"path":"2018/practical_open_redirect_via_path.md","ref":"2018/practical_open_redirect_via_path.md","articles":[]},{"title":"Request-URIのパスからのオープンリダイレクト","level":"2.2.2","depth":2,"path":"2018/open_redirect_via_path.md","ref":"2018/open_redirect_via_path.md","articles":[]},{"title":"SSRFを利用したメール送信ドメインの乗っ取り","level":"2.2.3","depth":2,"path":"2018/smtp_domain_takeover.md","ref":"2018/smtp_domain_takeover.md","articles":[]},{"title":"サイボウズ脆弱性報奨金制度で認定されたSSRF","level":"2.2.4","depth":2,"path":"2018/ssrf_in_cybozu.md","ref":"2018/ssrf_in_cybozu.md","articles":[]},{"title":"モナバコ脆弱性報奨金制度で認定された401インジェクション","level":"2.2.5","depth":2,"path":"2018/401i_in_monabako.md","ref":"2018/401i_in_monabako.md","articles":[]},{"title":"大和SEC×神戸脆弱性診断の会でペネトレーションテストを学ぶ","level":"2.2.6","depth":2,"path":"2018/learning_pentest_in_kobe.md","ref":"2018/learning_pentest_in_kobe.md","articles":[]},{"title":"CRLFインジェクションによるCookie Bombの脅威","level":"2.2.7","depth":2,"path":"2018/impact_of_cookie_bomb.md","ref":"2018/impact_of_cookie_bomb.md","articles":[]},{"title":"XSSワーム「Samy」の動作を解析する","level":"2.2.8","depth":2,"path":"2018/analyzing_samy_xss_worm.md","ref":"2018/analyzing_samy_xss_worm.md","articles":[]},{"title":"Request-URIのパスからのCRLFインジェクション","level":"2.2.9","depth":2,"path":"2018/crlfi_via_path_of_request-uri.md","ref":"2018/crlfi_via_path_of_request-uri.md","articles":[]}]},"previous":{"title":"HackerOneに報告された脆弱性をHackEDUで再現する","level":"2.1.3","depth":2,"path":"2019/hackedu.md","ref":"2019/hackedu.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["-sharing"],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"book.css"}},"file":{"path":"2019/text_injection.md","mtime":"2019-03-22T00:00:20.075Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2019-05-27T08:38:10.014Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

